zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/******************************************************************************
 Copyright (C) 2010  R&D Institute of HuaCai Co.,Ltd.
 File Name      : lpc1700_pin_cfg.h
 Description    : LPC1700系列CPU引脚连接与模式配置
 ------------------------------------------------------------------------------
 Modification History:
 <No.>  <version>       <time>      <author>        <contents>
   3、    2.00        2011-06-16      LFG            显示终端管脚配置
   2、    1.01        2010-08-20      LFG            CS5463的中断脚/INT由原来P1_21改到P0_30作为外部中断输入
   1、    1.00        2010-07-16      snap           the original version
******************************************************************************/

#ifndef __LPC1700_PIN_CFG_H
#define __LPC1700_PIN_CFG_H

/*----------------------------- macro definition ----------------------------*/

#if CODE_VER_TYPE==GPRS_MODULE_PRJ		//配合带CPU_GPRS模块
/******************************************************************************
** P0口引脚功能设置
******************************************************************************/
/*
 *  P0.0
 */
#define P0_0_GPIO             0x00                                      /* GPIO                         */
#define P0_0_RD1              0x01                                      /* CAN-1控制器接收引脚          */
#define P0_0_TXD3             0x02                                      /* UART3发送引脚                */
#define P0_0_SDA1             0x03                                      /* I2C-1数据线（开漏）          */

#define P0_0_FNUC             P0_0_SDA1

/*
 *  P0.1
 */
#define P0_1_GPIO             0x00                                      /* GPIO                         */
#define P0_1_TD1              0x01                                      /* CAN-1控制器发送引脚          */
#define P0_1_RXD3             0x02                                      /* UART3接收引脚                */
#define P0_1_SCL1             0x03                                      /* I2C-1时钟线（开漏）          */

#define P0_1_FNUC             P0_1_SCL1

/*
 *  P0.2
 */
#define P0_2_GPIO             0x00                                      /* GPIO                         */
#define P0_2_TXD0             0x01                                      /* UART0发送引脚                */
#define P0_2_AD07             0x02                                      /* AD0.7引脚                    */
//...   Reserved              0x03

#define P0_2_FNUC             P0_2_TXD0

/*
 *  P0.3
 */
#define P0_3_GPIO             0x00                                      /* GPIO                         */
#define P0_3_RXD0             0x01                                      /* UART0接收引脚                */
#define P0_3_AD06             0x02                                      /* AD0.6引脚                    */
//...   Reserved              0x03

#define P0_3_FNUC             P0_3_RXD0

/*
 *  P0.4
 */
#define P0_4_GPIO             0x00                                      /* GPIO                         */
#define P0_4_I2SRX_CLK        0x01                                      /* I2S总线接收时钟SCK           */
#define P0_4_RD2              0x02                                      /* CAN-2接收线                  */
#define P0_4_CAP20            0x03                                      /* 定时器2捕获输入，通道0       */

#define P0_4_FNUC             P0_4_GPIO

/*
 *  P0.5
 */
#define P0_5_GPIO             0x00                                      /* GPIO                         */
#define P0_5_I2SRX_WS         0x01                                      /* I2S总线接收字选择WS          */
#define P0_5_TD2              0x02                                      /* CAN-2发送线                  */
#define P0_5_CAP21            0x03                                      /* 定时器2捕获输入，通道1       */

#define P0_5_FNUC             P0_5_GPIO

/*
 *  P0.6
 */
#define P0_6_GPIO             0x00                                      /* GPIO                         */
#define P0_6_I2SRX_SDA        0x01                                      /* I2S总线接收数据线SD          */
#define P0_6_SSEL1            0x02                                      /* SSP-1总线从机选择            */
#define P0_6_MAT20            0x03                                      /* 定时器2匹配输出，通道0       */

#define P0_6_FNUC             P0_6_GPIO

/*
 *  P0.7
 */
#define P0_7_GPIO             0x00                                      /* GPIO                         */
#define P0_7_I2STX_CLK        0x01                                      /* I2S总线发送时钟线SCK         */
#define P0_7_SSCK1            0x02                                      /* SSP-1时钟线                  */
#define P0_7_MAT21            0x03                                      /* 定时器2匹配输出，通道1       */

//#ifdef PHASE_C_MODULE
#define P0_7_FNUC             P0_7_SSCK1
//#else// PHASE_C_MODULE
//#define P0_7_FNUC             P0_7_GPIO
//#endif// PHASE_C_MODULE

/*
 *  P0.8
 */
#define P0_8_GPIO             0x00                                      /* GPIO                         */
#define P0_8_I2STX_WS         0x01                                      /* I2S总线发送字选择WS          */
#define P0_8_SMISO1           0x02                                      /* SSP-1主输入从输出数据线      */
#define P0_8_MAT22            0x03                                      /* 定时器2匹配输出，通道2       */

#define P0_8_FNUC             P0_8_SMISO1

/*
 *  P0.9
 */
#define P0_9_GPIO             0x00                                      /* GPIO                         */
#define P0_9_I2STX_SDA        0x01                                      /* I2S总线发送数据线SD          */
#define P0_9_SMOSI1           0x02                                      /* SSP-1主输出从输入数据线      */
#define P0_9_MAT23            0x03                                      /* 定时器2匹配输出，通道3       */

#define P0_9_FNUC             P0_9_SMOSI1

/*
 *  P0.10
 */
#define P0_10_GPIO            0x00                                      /* GPIO                         */
#define P0_10_TXD2            0x01                                      /* UART2发送引脚                */
#define P0_10_SDA2            0x02                                      /* I2C-2数据线(非开漏引脚)      */
#define P0_10_MAT30           0x03                                      /* 定时器3匹配输出，通道0       */

#define P0_10_FNUC            P0_10_TXD2

