zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P0.11
 */
#define P0_11_GPIO            0x00                                      /* GPIO                         */
#define P0_11_RXD2            0x01                                      /* UART2接收引脚                */
#define P0_11_SCL2            0x02                                      /* I2C-2时钟线(非开漏引脚)      */
#define P0_11_MAT31           0x03                                      /* 定时器3匹配输出，通道1       */

#define P0_11_FNUC            P0_11_RXD2

/*
 *  P0.15
 */
#define P0_15_GPIO            0x00                                      /* GPIO                         */
#define P0_15_TXD1            0x01                                      /* UART1发送引脚                */
#define P0_15_SCK0            0x02                                      /* SSP0时钟线                   */
#define P0_15_SCK             0x03                                      /* SPI时钟线                    */

#define P0_15_FNUC            P0_15_GPIO

/*
 *  P0.16
 */
#define P0_16_GPIO            0x00                                      /* GPIO                         */
#define P0_16_RXD1            0x01                                      /* UART1接收引脚                */
#define P0_16_SSEL0           0x02                                      /* SSP0从机选择                 */
#define P0_16_SSEL            0x03                                      /* SPI从机选择                  */

#define P0_16_FNUC            P0_16_GPIO

/*
 *  P0.17
 */
#define P0_17_GPIO            0x00                                      /* GPIO                         */
#define P0_17_CTS1            0x01                                      /* UART1清零发送信号CTS         */
#define P0_17_MISO0           0x02                                      /* SSP0主输入从输出数据线       */
#define P0_17_MISO            0x03                                      /* SPI主入从出数据线            */

#define P0_17_FNUC            P0_17_GPIO

/*
 *  P0.18
 */
#define P0_18_GPIO            0x00                                      /* GPIO                         */
#define P0_18_DCD1            0x01                                      /* UART1数据载波检测输入DCD     */
#define P0_18_MOSI0           0x02                                      /* SSP-0主输出从输入数据线      */
#define P0_18_MOSI            0x03                                      /* SPI主出从入数据线            */

#define P0_18_FNUC            P0_18_GPIO

/*
 *  P0.19
 */
#define P0_19_GPIO            0x00                                      /* GPIO                         */
#define P0_19_DSR1            0x01                                      /* UART1数据设置就绪DSR         */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_19_SDA1            0x03                                      /* I2C-1数据线（非开漏）        */

#define P0_19_FNUC            P0_19_GPIO

/*
 *  P0.20
 */
#define P0_20_GPIO            0x00                                      /* GPIO                         */
#define P0_20_DTR1            0x01                                      /* UART1终端就绪DTR             */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_20_SCL1            0x03                                      /* I2C-1时钟线（非开漏）        */

#define P0_20_FNUC            P0_20_GPIO

/*
 *  P0.21
 */
#define P0_21_GPIO            0x00                                      /* GPIO                         */
#define P0_21_RI1             0x01                                      /* UART1振铃信号                */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_21_RD1             0x03                                      /* CAN-1接收引脚                */

#define P0_21_FNUC            P0_21_GPIO

/*
 *  P0.22
 */
#define P0_22_GPIO            0x00                                      /* GPIO                         */
#define P0_22_RTS1            0x01                                      /* UART1请求发送引脚            */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_22_TD1             0x03                                      /* CAN-1发送线                  */

#define P0_22_FNUC            P0_22_GPIO

/*
 *  P0.23
 */
#define P0_23_GPIO            0x00                                      /* GPIO                         */
#define P0_23_AD00            0x01                                      /* ADC-0，通道0                 */
#define P0_23_I2SRX_CLK       0x02                                      /* I2S接收时钟SCK               */
#define P0_23_CAP30           0x03                                      /* 定时器3捕获输入，通道0       */

#define P0_23_FNUC            P0_23_AD00

/*
 *  P0.24
 */
#define P0_24_GPIO            0x00                                      /* GPIO                         */
#define P0_24_AD01            0x01                                      /* ADC-0，通道1                 */
#define P0_24_I2SRX_WS        0x02                                      /* I2S接收字选择WS              */
#define P0_24_CAP31           0x03                                      /* 定时器3捕获输入，通道1       */

#define P0_24_FNUC            P0_24_GPIO

/*
 *  P0.25
 */
#define P0_25_GPIO            0x00                                      /* GPIO                         */
#define P0_25_AD02            0x01                                      /* ADC-0，通道2                 */
#define P0_25_I2SRX_SDA       0x02                                      /* I2S接收数据SD                */
#define P0_25_TXD3            0x03                                      /* UART3发送引脚                */

#define P0_25_FNUC            P0_25_GPIO

/*
 *  P0.26
 */
#define P0_26_GPIO            0x00                                      /* GPIO                         */
#define P0_26_AD03            0x01                                      /* ADC-0，通道3                 */
#define P0_26_AOUT            0x02                                      /* DAC输出                      */
#define P0_26_RXD3            0x03                                      /* UART-3接收引脚               */

#define P0_26_FNUC            P0_26_GPIO

