zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P0.27
 */
#define P0_27_GPIO            0x00                                      /* GPIO                         */
#define P0_27_SDA0            0x01                                      /* I2C0数据输入/输出，开漏      */
#define P0_27_USB_SDA         0x02                                      /* USB接口I2C串行数据OTG收发器  */
//..    Reserved              0x03                                      /* 保留                         */

#define P0_27_FNUC            P0_27_GPIO

/*
 *  P0.28
 */
#define P0_28_GPIO            0x00                                      /* GPIO                         */
#define P0_28_SCL0            0x01                                      /* I2C0时钟输入，开漏           */
#define P0_28_USB_SCL         0x02                                      /* USB接口I2C时钟线，OTG收发器  */
//..    Reserved              0x03                                   /* 保留                         */

#define P0_28_FNUC            P0_28_GPIO

/*
 *  P0.29
 */
#define P0_29_GPIO            0x00                                      /* GPIO                         */
#define P0_29_USB_DD          0x01                                      /* USB双向数据D+线              */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P0_29_FNUC            P0_29_GPIO

/*
 *  P0.30
 */
#define P0_30_GPIO            0x00                                      /* GPIO                         */
#define P0_30_USB_DS          0x01                                      /* USB双向数据D-线              */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P0_30_FNUC            P0_30_GPIO

/******************************************************************************
** P1口引脚功能设置
******************************************************************************/
/*
 *  P1.0
 */
#define P1_0_GPIO             0x00                                      /* GPIO                         */
#define P1_0_ENET_TXD0        0x01                                      /* 以太网发送数据脚0            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_0_FNUC             P1_0_GPIO

/*
 *  P1.1
 */
#define P1_1_GPIO             0x00                                      /* GPIO                         */
#define P1_1_ENET_TX_EN       0x01                                      /* 以太网发送数据脚1            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_1_FNUC             P1_1_GPIO

/*
 *  P1.4
 */
#define P1_4_GPIO             0x00                                      /* GPIO                         */
#define P1_4_ENET_TX_EN       0x01                                      /* 以太网发送使能               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_4_FNUC             P1_4_GPIO

/*
 *  P1.8
 */
#define P1_8_GPIO             0x00                                      /* GPIO                         */
#define P1_8_ENET_CRS         0x01                                      /* 以太网载波侦测脚             */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_8_FNUC             P1_8_GPIO

/*
 *  P1.9
 */
#define P1_9_GPIO             0x00                                      /* GPIO                         */
#define P1_9_ENET_RXD0        0x01                                      /* 以太网接收数据脚0            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_9_FNUC             P1_9_GPIO

/*
 *  P1.10
 */
#define P1_10_GPIO            0x00                                      /* GPIO                         */
#define P1_10_ENET_RXD1       0x01                                      /* 以太网接收数据脚1            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_10_FNUC            P1_10_GPIO

/*
 *  P1.11
 */
#define P1_14_GPIO            0x00                                      /*  GPIO                        */
#define P1_14_ENET_RX_ER      0x01                                      /* 以太网接收错误               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_14_FNUC            P1_14_GPIO

/*
 *  P1.15
 */
#define P1_15_GPIO            0x00                                      /* GPIO                         */
#define P1_15_ENET_REF_CLK    0x01                                      /* 以太网参拷时钟输入           */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_15_FNUC            P1_15_GPIO

/*
 *  P1.16
 */
#define P1_16_GPIO            0x00                                      /* GPIO                         */
#define P1_16_ENET_MDC        0x01                                      /* 以太网MIIM时钟               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_16_FNUC            P1_16_GPIO

