zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P1.17
 */
#define P1_17_GPIO            0x00                                      /* GPIO                         */
#define P1_17_ENET_MDIO       0x01                                      /* 以太网MI数据输入\输出        */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_17_FNUC            P1_17_GPIO

/*
 *  P1.18
 */
#define P1_18_GPIO            0x00                                      /*  GPIO                        */
#define P1_18_USB_UP_LED      0x01                                      /* USB GOODLINK指示脚           */
#define P1_18_PWM11           0x02                                      /* PWM1输出，通道1              */
#define P1_18_CAP10           0x03                                      /* Timer1捕获输入，通道0        */

#define P1_18_FNUC            P1_18_GPIO//

/*
 *  P1.19
 */
#define P1_19_GPIO            0x00                                      /*  GPIO                        */
#define P1_19_MCO0A           0x01                                      /* 电机控制PWM通道0，输出A      */
#define P1_19_USB_PPWR        0x02                                      /* USB端口电源使能信号          */
#define P1_19_CAP11           0x03                                      /* Timer1捕获输入，通道1        */

#define P1_19_FNUC            P1_19_GPIO

/*
 *  P1.20
 */
#define P1_20_GPIO            0x00                                      /*  GPIO                        */
#define P1_20_MCFB0           0x01                                      /* 电机控制PWM通道0，回环输入   */
#define P1_20_PWM12           0x02                                      /* PWM-2输出，通道2             */
#define P1_20_SCK0            0x03                                      /* SSP-0时钟输入                */

#define P1_20_FNUC            P1_20_GPIO

/*
 *  P1.21
 */
#define P1_21_GPIO            0x00                                      /* GPIO                         */
#define P1_21_MCABORT         0x01                                      /* 电机控制PWM，紧急中止        */
#define P1_21_PWM13           0x02                                      /* PWM-1输出，通道3             */
#define P1_21_SSEL0           0x03                                      /* SSP-0从机选择                */

#define P1_21_FNUC            P1_21_GPIO

/*
 *  P1.22
 */
#define P1_22_GPIO            0x00                                      /* GPIO                         */
#define P1_22_MC0B            0x01                                      /* 电机控制PWM通道0，输出B      */
#define P1_22_USB_PWRD        0x02                                      /* USB端口的电源状态            */
#define P1_22_MAT10           0x03                                      /* 定时器1匹配输出，通道0       */

#define P1_22_FNUC            P1_22_GPIO

/*
 *  P1.23
 */
#define P1_23_GPIO            0x00                                      /* GPIO                         */
#define P1_23_MCFB1           0x01                                      /* 电机控制PWM通道1，反馈输入   */
#define P1_23_PWM14           0x02                                      /* PWM-1输出，通道4             */
#define P1_23_MISO0           0x03                                      /* SSP-0主机输入，从机输出      */

#define P1_23_FNUC            P1_23_GPIO

/*
 *  P1.24
 */
#define P1_24_GPIO            0x00                                      /* GPIO                         */
#define P1_24_MCFB2           0x01                                      /* 电机控制PWM通道2，反馈输入   */
#define P1_24_PWM15           0x02                                      /* PWM-1输出，通道5             */
#define P1_24_MOSI0           0x03                                      /* SSP-0主机输出，从机输入      */

#define P1_24_FNUC            P1_24_GPIO

/*
 *  P1.25
 */
#define P1_25_GPIO            0x00                                      /* GPIO                         */
#define P1_25_MC1A            0x01                                      /* 电机控制PWM通道1，输出A      */
#define P1_25_CLKOUT          0x02                                      /* 时钟输出引脚                 */
#define P1_25_MAT11           0x03                                      /* 定时器1匹配输出，通道1       */

#define P1_25_FNUC            P1_25_GPIO

/*
 *  P1.26
 */
#define P1_26_GPIO            0x00                                      /* GPIO                         */
#define P1_26_MC1B            0x01                                      /* 电机控制PWM通道1，输出B      */
#define P1_26_PWM16           0x02                                      /* PWM-1输出，通道6             */
#define P1_26_CAP00           0x03                                      /* 定时器0捕获输入，通道0       */

#define P1_26_FNUC            P1_26_PWM16//P1_26_GPIO

/*
 *  P1.27
 */
#define P1_27_GPIO            0x00                                      /* GPIO                         */
#define P1_27_CLKOUT          0x01                                      /* 时钟输出引脚                 */
#define P1_27_USB_OVRCR       0x02                                      /* USB端口过载电流状态          */
#define P1_27_CAP01           0x03                                      /* 定时器0捕获输入，通道1       */

#define P1_27_FNUC            P1_27_GPIO

/*
 *  P1.28
 */
#define P1_28_GPIO            0x00                                      /* GPIO                         */
#define P1_28_MC2A            0x01                                      /* 电机控制PWM通道2，输出A      */
#define P1_28_PCAP10          0x02                                      /* PWM-1捕获输入，通道0         */
#define P1_28_MAT00           0x03                                      /* 定时器0匹配输出，通道0       */

#define P1_28_FNUC            P1_28_GPIO

/*
 *  P1.29
 */
#define P1_29_GPIO            0x00                                      /* GPIO                         */
#define P1_29_MC2B            0x01                                      /* 电机控制PWM通道2，输出B      */
#define P1_29_PCAP11          0x02                                      /* PWM-1捕获输入，通道1         */
#define P1_29_MAT01           0x03                                      /* 定时器0匹配输出，通道1       */

#define P1_29_FNUC            P1_29_GPIO

