zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P2.11
 */
#define P2_11_GPIO            0x00                                      /* GPIO                         */
#define P2_11_EINT1           0x01                                      /* 外部中断1输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_11_I2STX_CLK       0x03                                      /* I2S发送时钟SCK               */
#define P2_11_FNUC            P2_11_GPIO
//#define P2_11_FNUC            P2_11_EINT1

/*
 *  P2.12
 */
#define P2_12_GPIO            0x00                                      /* GPIO                         */
#define P2_12_EINT2           0x01                                      /* 外部中断2输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_12_I2STX_WS        0x03                                      /* I2S发送字选择WS              */
#define P2_12_FNUC            P2_12_GPIO
//#define P2_12_FNUC            P2_12_EINT2

/*
 *  P2.13
 */
#define P2_13_GPIO            0x00                                      /* GPIO                         */
#define P2_13_EINT3           0x01                                      /* 外部中断3输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_13_I2STX_SDA       0x03                                      /* I2S发送数据SD                */

#define P2_13_FNUC            P2_13_GPIO//P2_13_EINT3

/******************************************************************************
** P3口引脚功能设置
******************************************************************************/
/*
 *  P3.25
 */
#define P3_25_GPIO            0x00                                      /*  GPIO                        */
//...   Reserved              0x01                                      /*  保留                        */
#define P3_25_MAT00           0x02                                      /*  定时器0匹配输出，通道0      */
#define P3_25_PWM12           0x03                                      /*  PWM-1输出，通道2            */

#define P3_25_FNUC            P3_25_GPIO

/*
 *  P3.26
 */
#define P3_26_GPIO            0x00                                      /* GPIO                         */
#define P3_26_STCLK           0x01                                      /* 系统节拍定时器时钟输入       */
#define P3_26_MAT01           0x02                                      /* 定时器0匹配输出，通道1       */
#define P3_26_PWM13           0x03                                      /* PWM-1输出，通道3             */

#define P3_26_FNUC            P3_26_GPIO

/******************************************************************************
** P4口引脚功能设置
******************************************************************************/
/*
 *  P4.28
 */
#define P4_28_GPIO            0x00                                      /* GPIO                         */
#define P4_28_RX_MCLK         0x01                                      /* —I2S接收主机时钟            */
#define P4_28_MAT20           0x02                                      /* 定时器2匹配输出，通道0       */
#define P4_28_TXD3            0x03                                      /* UART3发送引脚                */

#define P4_28_FNUC            P4_28_TXD3

/*
 *  P4.29
 */
#define P4_29_GPIO            0x00                                      /* GPIO                         */
#define P4_29_TX_MCLK         0x01                                      /* I2S发送主机时钟              */
#define P4_29_MAT21           0x02                                      /* 定时器2匹配输出，通道1       */
#define P4_29_RXD3            0x03                                      /* UART3接收引脚                */

#define P4_29_FNUC            P4_29_RXD3


/******************************************************************************
** P10  The Trace Port Interface Unit (TPIU)
******************************************************************************/

/*
 *  bit[3]
 */
#define TPIU_Disable          0x00                                      /* TPIU interface 禁止          */
#define TPIU_Enable           0x01                                      /* TPIU interface 使能          */

#define P10_3_FNUC            TPIU_Disable

/******************************************************************************
** 引脚内部上下拉电阻配置
******************************************************************************/
#define PIN_PULL_UP           0x00u                                     /* 引脚内部上拉                 */
#define PIN_REPEATER          0x01u                                     /* 引脚内部上拉                 */
#define PIN_NO_PULL           0x02u                                     /* 引脚既不上拉，也不下拉       */
#define PIN_PULL_DOWN         0x03u                                     /* 引脚内部下拉                 */

/*
 *  P0
 */
#define P0_0_MODE             PIN_NO_PULL
#define P0_1_MODE             PIN_NO_PULL
#define P0_2_MODE             PIN_NO_PULL
#define P0_3_MODE             PIN_NO_PULL
#define P0_4_MODE             PIN_NO_PULL         //下拉
#define P0_5_MODE             PIN_NO_PULL         //下拉
#define P0_6_MODE             PIN_NO_PULL           //上拉
#define P0_7_MODE             PIN_NO_PULL
#define P0_8_MODE             PIN_NO_PULL
#define P0_9_MODE             PIN_NO_PULL
#define P0_10_MODE            PIN_NO_PULL
#define P0_11_MODE            PIN_PULL_UP//PIN_NO_PULL
#define P0_12_MODE            PIN_NO_PULL
#define P0_13_MODE            PIN_NO_PULL
#define P0_14_MODE            PIN_NO_PULL
#define P0_15_MODE            PIN_NO_PULL

#define P0_16_MODE            PIN_NO_PULL
#define P0_17_MODE            PIN_NO_PULL         //上拉
#define P0_18_MODE            PIN_NO_PULL
#define P0_19_MODE            PIN_NO_PULL
#define P0_20_MODE            PIN_NO_PULL
#define P0_21_MODE            PIN_NO_PULL
#define P0_22_MODE            PIN_NO_PULL
#define P0_23_MODE            PIN_NO_PULL
#define P0_24_MODE            PIN_NO_PULL
#define P0_25_MODE            PIN_NO_PULL
#define P0_26_MODE            PIN_NO_PULL
#define P0_27_MODE            PIN_NO_PULL
#define P0_28_MODE            PIN_NO_PULL
#define P0_29_MODE            PIN_NO_PULL
#define P0_30_MODE            PIN_NO_PULL
#define P0_31_MODE            PIN_NO_PULL

