zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P1
 */
#define P1_0_MODE             PIN_NO_PULL
#define P1_1_MODE             PIN_NO_PULL
#define P1_2_MODE             PIN_NO_PULL
#define P1_3_MODE             PIN_NO_PULL
#define P1_4_MODE             PIN_NO_PULL
#define P1_5_MODE             PIN_NO_PULL
#define P1_6_MODE             PIN_NO_PULL
#define P1_7_MODE             PIN_NO_PULL
#define P1_8_MODE             PIN_NO_PULL
#define P1_9_MODE             PIN_NO_PULL
#define P1_10_MODE            PIN_NO_PULL
#define P1_11_MODE            PIN_NO_PULL
#define P1_12_MODE            PIN_NO_PULL
#define P1_13_MODE            PIN_NO_PULL
#define P1_14_MODE            PIN_NO_PULL
#define P1_15_MODE            PIN_NO_PULL
#define P1_16_MODE            PIN_NO_PULL     //下拉
#define P1_17_MODE            PIN_NO_PULL
#define P1_18_MODE            PIN_NO_PULL
#define P1_19_MODE            PIN_NO_PULL
#define P1_20_MODE            PIN_NO_PULL
#define P1_21_MODE            PIN_NO_PULL
#define P1_22_MODE            PIN_NO_PULL
#define P1_23_MODE            PIN_NO_PULL
#define P1_24_MODE            PIN_NO_PULL
#define P1_25_MODE            PIN_NO_PULL
#define P1_26_MODE            PIN_NO_PULL
#define P1_27_MODE            PIN_NO_PULL
#define P1_28_MODE            PIN_NO_PULL
#define P1_29_MODE            PIN_NO_PULL
#define P1_30_MODE            PIN_NO_PULL
#define P1_31_MODE            PIN_NO_PULL

/*
 *  P2
 */
#define P2_0_MODE             PIN_NO_PULL
#define P2_1_MODE             PIN_PULL_UP//PIN_NO_PULL
#define P2_2_MODE             PIN_NO_PULL//PIN_PULL_DOWN         //下拉
#define P2_3_MODE             PIN_NO_PULL
#define P2_4_MODE             PIN_NO_PULL
#define P2_5_MODE             PIN_NO_PULL
#define P2_6_MODE             PIN_NO_PULL
#define P2_7_MODE             PIN_NO_PULL
#define P2_8_MODE             PIN_NO_PULL
#define P2_9_MODE             PIN_NO_PULL
#define P2_10_MODE            PIN_NO_PULL
#define P2_11_MODE            PIN_NO_PULL
#define P2_12_MODE            PIN_NO_PULL
#define P2_13_MODE            PIN_NO_PULL
#define P2_14_MODE            PIN_NO_PULL
#define P2_15_MODE            PIN_NO_PULL

/*
 *  P3
 */
#define P3_25_MODE            PIN_NO_PULL//PIN_PULL_UP       //上拉
#define P3_26_MODE            PIN_NO_PULL//PIN_PULL_DOWN     //下拉

/*
 *  P4
 */
#define P4_28_MODE            PIN_NO_PULL
#define P4_29_MODE            PIN_PULL_UP//PIN_NO_PULL

/******************************************************************************
** 按原理图定义PIN
******************************************************************************/
/*
 *  P0信号宏定义
 */
#define     P0_SDA_E2           (1ul << 0)
#define     P0_SCL_E2           (1ul << 1)
#define     P0_TXD_4851         (1ul << 2)
#define     P0_RXD_4851         (1ul << 3)
#define     P0_GPRS_4851_CTL    (1ul << 4)// W OR R
#define     P0_F1_WP            (1ul << 5)
#define     P0_F1_CS1           (1ul << 6)
#define     P0_FLASH_SCK1       (1ul << 7)
#define     P0_FLASH_SDO1       (1ul << 8)  
#define     P0_FLASH_SDI1       (1ul << 9)

#define     P0_RXD_PLCM         (1ul << 10)//cpu的发送 载波的收
#define     P0_TXD_PLCM         (1ul << 11)
//                              (1ul << 12)
//                              (1ul << 13)
//                              (1ul << 14)
#define     P0_RUN_LED          (1ul << 15)
//                              (1ul << 16)
//                              (1ul << 17)
//                              (1ul << 18)
//                              (1ul << 19)
#define     P0_EE_WP            (1ul << 20)
//                              (1ul << 21)
//                              (1ul << 22)
#define     P0_BAT_AD           (1ul << 23)
//                              (1ul << 24)
#define     P0_PD_CHK           (1ul << 25)
#define     P0_WDI              (1ul << 26)
//#define     P0_SDA_LCD          (1ul << 27)//azh
//#define     P0_SCL_LCD          (1ul << 28)
//                              (1ul << 29)
//                              (1ul << 30)
//                              (1ul << 31)

/*
 *  P1信号宏定义
 */
#define     P1_RLED_GPRS        (1ul << 0)
#define     P1_GLED_GPRS        (1ul << 1)
//                              (1ul << 2)
//                              (1ul << 3)
#define     P1_GPRS_RTS         (1ul << 4)
//                              (1ul << 5)
//                              (1ul << 6)
//                              (1ul << 7)
#define     P1_GPRS_CTS         (1ul << 8)
#define     P1_GPRS_DTR         (1ul << 9)
#define     P1_GPRS_DCD         (1ul << 10)
//                              (1ul << 11)
//                              (1ul << 12)
//                              (1ul << 13)
#define     P1_GPRS_RI          (1ul << 14)
#define     P1_CPU_IGT          (1ul << 15)
#define     P1_CPU_EVERGOFF     (1ul << 16)
#define     P1_EVENTOUT         (1ul << 17)//以前用于模块识别 现在用于与计量析通信握手
#define     P1_RLED_LOCAL       (1ul << 18)
#define     P1_GLED_LOCAL       (1ul << 19)
//                              (1ul << 20)
//                              (1ul << 21)
//                              (1ul << 22)
//                              (1ul << 23)
//                              (1ul << 24)
//                              (1ul << 25)
#define     P1_PWM_38K          (1ul << 26)
//                              (1ul << 27)
//                              (1ul << 28)
#define     P1_SET_EN           (1ul << 29)
//                              (1ul << 30)
#define     P1_RST_WLS          (1ul << 31)//azh 171011

/*
 *  P2信号宏定义
 */
#define     P2_TXD_LOCAL        (1ul << 0)
#define     P2_RXD_LOCAL        (1ul << 1)
#define     P2_CTS_WLS          (1ul << 2)//azh 171011
#define     P2_FAST_OFF         (1ul << 3)
#define     P2_BAT_ON           (1ul << 4)
#define     P2_VGPRS_ON         (1ul << 5)
#define     P2_CHAG_ON          (1ul << 6)
#define     P2_RTS_WLS          (1ul << 7)//P2_RTS_WLS
#define     P2_STATE_PLCM       (1ul << 8)
#define     P2_ZGB_PWR          (1ul << 9)//azh 171011 zigbee电源开关节约功耗
#define     P2_ISP_EN           (1ul << 10)
//                              (1ul << 11)
//                              (1ul << 12)
//                              (1ul << 13)

