zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P3信号宏定义
 */
//                              (1ul << 25)
//                              (1ul << 26)

/*
 *  P4信号宏定义
 */
#define     P4_MC52I_RXD        (1ul << 28)//CPU_TXD
#define     P4_MC52I_TXD        (1ul << 29)//CPU_RXD


/******************************************************************************
** 各个PORT口方向初始化值定义，把设置为输入的IO写到下面的宏，空闲的IO全部置为输出
******************************************************************************/
#define     P0_INIT_DIR         (~(P0_SDA_E2 |       \
                                   P0_FLASH_SDO1 |   \
                                   P0_RXD_4851 |     \
                                   P0_TXD_PLCM |     \
                                   P0_BAT_AD |       \
                                   P0_PD_CHK         \
                                   )                 \
                                )

#define     P1_INIT_DIR         (~(P1_SET_EN   |     \
                                   P1_GPRS_DCD |     \
                                   P1_GPRS_CTS |     \
                                   P1_GPRS_RI  |     \
                                   P1_EVENTOUT       \
                                  )                  \
                                )

#define     P2_INIT_DIR        (~(P2_RXD_LOCAL |     \
                                   P2_ISP_EN |       \
                                   P2_CTS_WLS |      \
                                   P2_STATE_PLCM     \
                                   )                 \
                                )

#define     P3_INIT_DIR         (0xffffffff)

#define     P4_INIT_DIR         (~(P4_MC52I_TXD      \
                                   )                 \
                                )

/******************************************************************************
** 各个PORT口输出初始化值定义，把设置为输出‘1’的IO写到下面的宏，空闲的IO全部置为输出‘0’
******************************************************************************/
#define     P0_INIT_DATA        (P0_SCL_E2 |         \
                                 P0_TXD_4851 |       \
                                 P0_F1_CS1 |         \
                                 P0_FLASH_SCK1 |     \
                                 P0_FLASH_SDI1 |     \
                                 P0_RXD_PLCM |       \
                                 P0_RUN_LED|         \
                                 P0_GPRS_4851_CTL |  \
                                 P0_EE_WP            \
                                 )

#define     P1_INIT_DATA        (P1_RLED_LOCAL |     \
                                 P1_GLED_LOCAL |     \
                                 P1_CPU_IGT |        \
                                 P1_CPU_EVERGOFF |   \
                                 P1_SET_EN           \
                                 )

#define     P2_INIT_DATA        (P2_TXD_LOCAL |      \
                                 P2_RTS_WLS |        \
                                 P2_FAST_OFF         \
                                 )

#define     P3_INIT_DATA        (0         \
                                 )

#define     P4_INIT_DATA        (P4_MC52I_RXD)

/******************************************************************************
** 各个PORT口操作宏定义
******************************************************************************/
/*
 *  P0操作宏
 */
//#define     PVDD_ON()               FIO0DIR |= P0_PECTL;            \
//                                    FIO0CLR = P0_PECTL                  //PECTL输出‘0’,外设电源开启
//#define     PVDD_OFF()              FIO0DIR |= P0_PECTL;            \
//                                    FIO0SET = P0_PECTL                  //PECTL输出‘1’,外设电源关闭
#define     FLS1_CS_EN()            FIO0DIR |= P0_F1_CS1;           \
                                    FIO0CLR = P0_F1_CS1                 //F1_CS1输出‘0’,FLASH1片选使能
#define     FLS1_CS_DIS()           FIO0DIR |= P0_F1_CS1;           \
                                    FIO0SET = P0_F1_CS1                 //F1_CS1输出‘1’,FLASH1片选禁能
//#define     BEEP_ON_DIS()           FIO0DIR |= P0_BEEP_ON;          \
//                                    FIO0CLR = P0_BEEP_ON                //BEEP_ON输出‘0’关闭蜂鸣器
//#define     BEEP_ON_EN()            FIO0DIR |= P0_BEEP_ON;          \
//                                    FIO0SET = P0_BEEP_ON                //BEEP_ON输出‘1’开启蜂鸣器
//#define     ALARM_LED_ON()          FIO0DIR |= P0_ALARM_LED;        \
//                                    FIO0CLR = P0_ALARM_LED              //ALARM_LED输出‘0’点亮报警灯
//#define     ALARM_LED_OFF()         FIO0DIR |= P0_ALARM_LED;        \
//                                    FIO0SET = P0_ALARM_LED              //ALARM_LED输出‘1’熄灭报警灯
//#define     ESAM_RST_EN()           FIO0DIR |= P0_ESAM_RST;         \
//                                    FIO0CLR = P0_ESAM_RST               //ESAM_RST输出‘0’,使能复位?
//#define     ESAM_RST_DIS()          FIO0DIR |= P0_ESAM_RST;         \
//                                    FIO0SET = P0_ESAM_RST               //ESAM_RST输出‘1’,禁能复位?
#define     EE_WP_EN()              FIO0DIR |= P0_EE_WP;            \
                                    FIO0SET = P0_EE_WP                  //WP_E2输出‘1’,EEPROM写保护使能
#define     EE_WP_DIS()             FIO0DIR |= P0_EE_WP;            \
                                    FIO0CLR = P0_EE_WP                  //WP_E2输出‘0’,EEPROM写保护禁能
#define     SET_PORT0_IN(pin)       FIO0DIR &= ~pin
#define     PORT0_IS_HIGH(pin)     (FIO0PIN & pin)
#define     SET_PORT0_OUT(pin)      FIO0DIR |= pin
#define     SET_PORT0_HIGH(pin)     FIO0SET = pin
#define     SET_PORT0_LOW(pin)      FIO0CLR = pin
#define     SET_PORT0_REV(pin)      if(PORT0_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT0_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT0_HIGH(pin);        \
                                    }

