zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P1操作宏
 */
#define     IGT_ON()                FIO1DIR |= P1_CPU_IGT;          \
                                    FIO1CLR = P1_CPU_IGT                //CPU_IGT输出‘0’Turn on MC55/56
#define     IGT_OFF()               FIO1DIR |= P1_CPU_IGT;          \
                                    FIO1SET = P1_CPU_IGT                //CPU_IGT输出‘1’Turn off MC55/56
#define     EMERGOFF_EN()           FIO1DIR |= P1_CPU_EVERGOFF;     \
                                    FIO1CLR = P1_CPU_EVERGOFF           //CPU_EVERGOFF输出‘0’使能GPRS的EMERGOFF
#define     EMERGOFF_DIS()          FIO1DIR |= P1_CPU_EVERGOFF;     \
                                    FIO1SET = P1_CPU_EVERGOFF           //CPU_EVERGOFF输出‘1’禁能GPRS的EMERGOFF
//#define     BGLED_ON()              FIO1DIR |= P1_BGLED;            \
//                                    FIO1SET = P1_BGLED                  //BGLED输出‘1’,点亮LCD背光灯
//#define     BGLED_OFF()             FIO1DIR |= P1_BGLED;            \
//                                    FIO1CLR = P1_BGLED                  //BGLED输出‘0’,熄灭LCD背光灯

#define     WLS_RLED_OFF()           FIO1DIR |= P1_RLED_LOCAL;         \
                                    FIO1SET = P1_RLED_LOCAL               //RLED_LOCAL输出‘1’,点亮ZIGBEE红灯
#define     WLS_RLED_ON()          FIO1DIR |= P1_RLED_LOCAL;         \
                                    FIO1CLR = P1_RLED_LOCAL               //RLED_LOCAL输出‘0’,熄灭ZIGBEE红灯
#define     WLS_GLED_OFF()           FIO1DIR |= P1_GLED_LOCAL;         \
                                    FIO1SET = P1_GLED_LOCAL               //GLED_LOCAL输出‘1’,点亮ZIGBEE绿灯
#define     WLS_GLED_ON()          FIO1DIR |= P1_GLED_LOCAL;         \
                                    FIO1CLR = P1_GLED_LOCAL               //GLED_LOCAL输出‘0’,熄灭ZIGBEE绿灯
#define     GPRS_RLED_OFF()          FIO1DIR |= P1_RLED_GPRS;        \
                                    FIO1SET = P1_RLED_GPRS              //RLED_GPRS输出‘1’,点亮GPRS红灯
#define     GPRS_RLED_ON()         FIO1DIR |= P1_RLED_GPRS;        \
                                    FIO1CLR = P1_RLED_GPRS              //RLED_GPRS输出‘0’,熄灭GPRS红灯
#define     GPRS_GLED_OFF()          FIO1DIR |= P1_GLED_GPRS;        \
                                    FIO1SET = P1_GLED_GPRS              //GLED_GPRS输出‘1’,点亮GPRS绿灯
#define     GPRS_GLED_ON()         FIO1DIR |= P1_GLED_GPRS;        \
                                    FIO1CLR = P1_GLED_GPRS              //GLED_GPRS输出‘0’,熄灭GPRS绿灯

//#define     FUNOUT_ON()             FIO1DIR |= P1_FUNOUT;           \
//                                    FIO1CLR = P1_FUNOUT                 //FUNOUT输出‘0’,功能输出开启
//#define     FUNOUT_OFF()            FIO1DIR |= P1_FUNOUT;           \
//                                    FIO1SET = P1_FUNOUT                 //FUNOUT输出‘1’,功能输出关闭
//#define     ALARM_ON()              FIO1DIR |= P1_ALARM;            \
//                                    FIO1CLR = P1_ALARM                  //ALARM输出‘0’,报警输出开启
//#define     ALARM_OFF()             FIO1DIR |= P1_ALARM;            \
//                                    FIO1SET = P1_ALARM                  //ALARM输出‘1’,报警输出关闭
//#define     IR_VDD_ON()             FIO1DIR |= P1_IR_CTL;           \
//                                    FIO1CLR = P1_IR_CTL                 //IR_CTL输出‘0’,IRDA电源开启
//#define     IR_VDD_OFF()            FIO1DIR |= P1_IR_CTL;           \
//                                    FIO1SET = P1_IR_CTL                 //IR_CTL输出‘1’,IRDA电源关闭

//#define     DBG_LED_ON()            FIO1DIR |= P1_DBG_LED;          \
//                                    FIO1CLR = P1_DBG_LED                //DEBUG_LED输出‘0’,DEBUG_LED点亮
//#define     DBG_LED_OFF()           FIO1DIR |= P1_DBG_LED;          \
//                                    FIO1SET = P1_DBG_LED                //DEBUG_LED输出‘1’,DEBUG_LED熄灭
//#define     FLS2_CS_EN()            FIO1DIR |= P1_F1_CS2;           \
//                                    FIO1CLR = P1_F1_CS2                 //F1_CS2输出‘0’,FLASH2片选使能
//#define     FLS2_CS_DIS()           FIO1DIR |= P1_F1_CS2;           \
//                                    FIO1SET = P1_F1_CS2                 //F1_CS2输出‘1’,FLASH2片选禁能
#define     DF_WP_EN()              FIO0DIR |= (P0_F1_WP);          \
                                    FIO0CLR = (P0_F1_WP)               //F1_WP输出‘0’,FLASH1写保护使能
#define     DF_WP_DIS()             FIO0DIR |= (P0_F1_WP);          \
                                    FIO0SET = (P0_F1_WP)               //F1_WP输出‘1’,FLASH1写保护禁能
//#define     FM_WP_EN()              FIO1DIR |= P1_FM_WP;            \
//                                    FIO1SET = P1_FM_WP                  //WP_FM输出‘1’,FRAM写保护使能
//#define     FM_WP_DIS()             FIO1DIR |= P1_FM_WP;            \
//                                    FIO1CLR = P1_FM_WP                  //WP_FM输出‘0’,FRAM写保护禁能
//#define     WGP_ON()                FIO1DIR |= P1_CPU_WGP;          \
//                                    FIO1CLR = P1_CPU_WGP                //CPU_WGP输出‘0’,点亮无功灯并输出无功脉冲
//#define     WGP_OFF()               FIO1DIR |= P1_CPU_WGP;          \
//                                    FIO1SET = P1_CPU_WGP                //CPU_WGP输出‘1’,熄灭无功灯并关闭无功脉冲
#define     RUN_LED_ON()            FIO0DIR |= P0_RUN_LED;          \
                                    FIO0CLR = P0_RUN_LED                //CPU_YGP输出‘0’,点亮有功灯并输出有功脉冲
#define     RUN_LED_OFF()           FIO0DIR |= P0_RUN_LED;          \
                                    FIO0SET = P0_RUN_LED                //CPU_YGP输出‘1’,熄灭有功灯并关闭有功脉冲

#define     SET_PORT1_IN(pin)       FIO1DIR &= ~pin
#define     PORT1_IS_HIGH(pin)     (FIO1PIN & pin)
#define     SET_PORT1_OUT(pin)      FIO1DIR |= pin
#define     SET_PORT1_HIGH(pin)     FIO1SET = pin
#define     SET_PORT1_LOW(pin)      FIO1CLR = pin
#define     SET_PORT1_REV(pin)      if(PORT1_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT1_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT1_HIGH(pin);        \
                                    }

