zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P2操作宏
 */
#define     FAST_CHARGE_ON()        FIO2DIR |= P2_FAST_OFF;         \
                                    FIO2CLR = P2_FAST_OFF               //FAST_OFF输出‘0’开起充电
#define     FAST_CHARGE_OFF()       FIO2DIR |= P2_FAST_OFF;         \
                                    FIO2SET = P2_FAST_OFF               //FAST_OFF输出‘1’关闭充电
#define     CHARGE_EN()             FIO2DIR |= P2_CHAG_ON;          \
                                    FIO2SET = P2_CHAG_ON                //CHAG_ON输出‘1’,GPRS充电电源开启
#define     CHARGE_DIS()            FIO2DIR |= P2_CHAG_ON;          \
                                    FIO2CLR = P2_CHAG_ON                //CHAG_ON输出‘1’,GPRS充电电源关闭
#define     BAT_ON()                FIO2DIR |= P2_BAT_ON;          \
                                    FIO2SET = P2_BAT_ON                //BAT_ON输出‘0’,GPRS电池开启
#define     BAT_OFF()               FIO2DIR |= P2_BAT_ON;          \
                                    FIO2CLR = P2_BAT_ON                //BAT_ON输出‘1’,GPRS电池关闭
#define     GPRS_POWER_DIS()        FIO2DIR |= P2_VGPRS_ON;         \
                                    FIO2CLR = P2_VGPRS_ON               //VGPRS_ON输出‘0’禁能GPRS供电
#define     GPRS_POWER_EN()         FIO2DIR |= P2_VGPRS_ON;         \
                                    FIO2SET = P2_VGPRS_ON               //VGPRS_ON输出‘1’开启GPRS供电
//azh 171011 电子式高压表GPRS模块用到zigbee模块，所以打开模块复位脚并且是P1口，还有zigbee模块的电源开启
#define     WLS_RST_LOW()           FIO1DIR |= P1_RST_WLS;          \
                                    FIO1CLR = P1_RST_WLS                //RST_WLS输出‘0’,ZigBee复位使能
#define     WLS_RST_HIGH()          FIO1DIR |= P1_RST_WLS;          \
                                    FIO1SET = P1_RST_WLS                //RST_WLS输出‘1’,ZigBee复位禁能
#define     ZIGBEE_POWER_OFF()       FIO2DIR |= P2_ZGB_PWR;         \
                                    FIO2CLR = P2_ZGB_PWR               //P2_ZGB_PWR输出‘0’开启GPRS供电//OFF azh 171014 加上三极管逻辑要反一反
#define     ZIGBEE_POWER_ON()      FIO2DIR |= P2_ZGB_PWR;         \
                                    FIO2SET = P2_ZGB_PWR               //P2_ZGB_PWR输出‘1’关闭GPRS供电

#define     PLC_RST_LOW()           FIO2DIR |= P2_RST_PLC;          \
                                    FIO2CLR = P2_RST_PLC                //RST_PLC输出‘0’,ZigBee复位使能
#define     PLC_RST_HIGH()          FIO2DIR |= P2_RST_PLC;          \
                                    FIO2SET = P2_RST_PLC                //RST_PLC输出‘1’,ZigBee复位禁能
//#define     VLCD_ON()               FIO2DIR |= P2_DIS_CTL;          \
//                                    FIO2SET = P2_DIS_CTL                //DIS_CTL输出‘1’,LCD电源开启
//#define     VLCD_OFF()              FIO2DIR |= P2_DIS_CTL;          \
//                                    FIO2CLR = P2_DIS_CTL                //DIS_CTL输出‘0’,LCD电源关闭

#define     SET_PORT2_IN(pin)       FIO2DIR &= ~pin
#define     PORT2_IS_HIGH(pin)     (FIO2PIN & pin)
#define     SET_PORT2_OUT(pin)      FIO2DIR |= pin
#define     SET_PORT2_HIGH(pin)     FIO2SET = pin
#define     SET_PORT2_LOW(pin)      FIO2CLR = pin
#define     SET_PORT2_REV(pin)      if(PORT2_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT2_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT2_HIGH(pin);        \
                                    }

/*
 *  P3操作宏
 */
#define     SET_PORT3_IN(pin)       FIO3DIR &= ~pin
#define     PORT3_IS_HIGH(pin)     (FIO3PIN & pin)
#define     SET_PORT3_OUT(pin)      FIO3DIR |= pin
#define     SET_PORT3_HIGH(pin)     FIO3SET = pin
#define     SET_PORT3_LOW(pin)      FIO3CLR = pin
#define     SET_PORT3_REV(pin)      if(PORT3_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT3_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT3_HIGH(pin);        \
                                    }


/*
 *  P4操作宏
 */
#define     SET_PORT4_IN(pin)       FIO4DIR &= ~pin
#define     PORT4_IS_HIGH(pin)     (FIO4PIN & pin)
#define     SET_PORT4_OUT(pin)      FIO4DIR |= pin
#define     SET_PORT4_HIGH(pin)     FIO4SET = pin
#define     SET_PORT4_LOW(pin)      FIO4CLR = pin
#define     SET_PORT4_REV(pin)      if(PORT4_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT4_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT4_HIGH(pin);        \
                                    }
#else//H_METER_PRJ,WLS_CUR_PRJ
/******************************************************************************
** P0口引脚功能设置
******************************************************************************/
/*
 *  P0.0
 */
#define P0_0_GPIO             0x00                                      /* GPIO                         */
#define P0_0_RD1              0x01                                      /* CAN-1控制器接收引脚          */
#define P0_0_TXD3             0x02                                      /* UART3发送引脚                */
#define P0_0_SDA1             0x03                                      /* I2C-1数据线（开漏）          */

#define P0_0_FNUC             P0_0_SDA1

/*
 *  P0.1
 */
#define P0_1_GPIO             0x00                                      /* GPIO                         */
#define P0_1_TD1              0x01                                      /* CAN-1控制器发送引脚          */
#define P0_1_RXD3             0x02                                      /* UART3接收引脚                */
#define P0_1_SCL1             0x03                                      /* I2C-1时钟线（开漏）          */

#define P0_1_FNUC             P0_1_SCL1

