zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P0.2
 */
#define P0_2_GPIO             0x00                                      /* GPIO                         */
#define P0_2_TXD0             0x01                                      /* UART0发送引脚                */
#define P0_2_AD07             0x02                                      /* AD0.7引脚                    */
//...   Reserved              0x03

#define P0_2_FNUC             P0_2_TXD0

/*
 *  P0.3
 */
#define P0_3_GPIO             0x00                                      /* GPIO                         */
#define P0_3_RXD0             0x01                                      /* UART0接收引脚                */
#define P0_3_AD06             0x02                                      /* AD0.6引脚                    */
//...   Reserved              0x03

#define P0_3_FNUC             P0_3_RXD0

/*
 *  P0.4
 */
#define P0_4_GPIO             0x00                                      /* GPIO                         */
#define P0_4_I2SRX_CLK        0x01                                      /* I2S总线接收时钟SCK           */
#define P0_4_RD2              0x02                                      /* CAN-2接收线                  */
#define P0_4_CAP20            0x03                                      /* 定时器2捕获输入，通道0       */

#define P0_4_FNUC             P0_4_GPIO

/*
 *  P0.5
 */
#define P0_5_GPIO             0x00                                      /* GPIO                         */
#define P0_5_I2SRX_WS         0x01                                      /* I2S总线接收字选择WS          */
#define P0_5_TD2              0x02                                      /* CAN-2发送线                  */
#define P0_5_CAP21            0x03                                      /* 定时器2捕获输入，通道1       */

#define P0_5_FNUC             P0_5_GPIO

/*
 *  P0.6
 */
#define P0_6_GPIO             0x00                                      /* GPIO                         */
#define P0_6_I2SRX_SDA        0x01                                      /* I2S总线接收数据线SD          */
#define P0_6_SSEL1            0x02                                      /* SSP-1总线从机选择            */
#define P0_6_MAT20            0x03                                      /* 定时器2匹配输出，通道0       */

#define P0_6_FNUC             P0_6_GPIO

/*
 *  P0.7
 */
#define P0_7_GPIO             0x00                                      /* GPIO                         */
#define P0_7_I2STX_CLK        0x01                                      /* I2S总线发送时钟线SCK         */
#define P0_7_SSCK1            0x02                                      /* SSP-1时钟线                  */
#define P0_7_MAT21            0x03                                      /* 定时器2匹配输出，通道1       */

//#ifdef PHASE_C_MODULE
#define P0_7_FNUC             P0_7_SSCK1
//#else// PHASE_C_MODULE
//#define P0_7_FNUC             P0_7_GPIO
//#endif// PHASE_C_MODULE

/*
 *  P0.8
 */
#define P0_8_GPIO             0x00                                      /* GPIO                         */
#define P0_8_I2STX_WS         0x01                                      /* I2S总线发送字选择WS          */
#define P0_8_SMISO1           0x02                                      /* SSP-1主输入从输出数据线      */
#define P0_8_MAT22            0x03                                      /* 定时器2匹配输出，通道2       */

#define P0_8_FNUC             P0_8_SMISO1

/*
 *  P0.9
 */
#define P0_9_GPIO             0x00                                      /* GPIO                         */
#define P0_9_I2STX_SDA        0x01                                      /* I2S总线发送数据线SD          */
#define P0_9_SMOSI1           0x02                                      /* SSP-1主输出从输入数据线      */
#define P0_9_MAT23            0x03                                      /* 定时器2匹配输出，通道3       */

#define P0_9_FNUC             P0_9_SMOSI1

/*
 *  P0.10
 */
#define P0_10_GPIO            0x00                                      /* GPIO                         */
#define P0_10_TXD2            0x01                                      /* UART2发送引脚                */
#define P0_10_SDA2            0x02                                      /* I2C-2数据线(非开漏引脚)      */
#define P0_10_MAT30           0x03                                      /* 定时器3匹配输出，通道0       */

#define P0_10_FNUC            P0_10_TXD2

/*
 *  P0.11
 */
#define P0_11_GPIO            0x00                                      /* GPIO                         */
#define P0_11_RXD2            0x01                                      /* UART2接收引脚                */
#define P0_11_SCL2            0x02                                      /* I2C-2时钟线(非开漏引脚)      */
#define P0_11_MAT31           0x03                                      /* 定时器3匹配输出，通道1       */

#define P0_11_FNUC            P0_11_RXD2

/*
 *  P0.15
 */
#define P0_15_GPIO            0x00                                      /* GPIO                         */
#define P0_15_TXD1            0x01                                      /* UART1发送引脚                */
#define P0_15_SCK0            0x02                                      /* SSP0时钟线                   */
#define P0_15_SCK             0x03                                      /* SPI时钟线                    */

#define P0_15_FNUC            P0_15_GPIO

/*
 *  P0.16
 */
#define P0_16_GPIO            0x00                                      /* GPIO                         */
#define P0_16_RXD1            0x01                                      /* UART1接收引脚                */
#define P0_16_SSEL0           0x02                                      /* SSP0从机选择                 */
#define P0_16_SSEL            0x03                                      /* SPI从机选择                  */

#define P0_16_FNUC            P0_16_GPIO

/*
 *  P0.17
 */
#define P0_17_GPIO            0x00                                      /* GPIO                         */
#define P0_17_CTS1            0x01                                      /* UART1清零发送信号CTS         */
#define P0_17_MISO0           0x02                                      /* SSP0主输入从输出数据线       */
#define P0_17_MISO            0x03                                      /* SPI主入从出数据线            */

