zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
#define P0_17_FNUC            P0_17_GPIO

/*
 *  P0.18
 */
#define P0_18_GPIO            0x00                                      /* GPIO                         */
#define P0_18_DCD1            0x01                                      /* UART1数据载波检测输入DCD     */
#define P0_18_MOSI0           0x02                                      /* SSP-0主输出从输入数据线      */
#define P0_18_MOSI            0x03                                      /* SPI主出从入数据线            */

#define P0_18_FNUC            P0_18_GPIO

/*
 *  P0.19
 */
#define P0_19_GPIO            0x00                                      /* GPIO                         */
#define P0_19_DSR1            0x01                                      /* UART1数据设置就绪DSR         */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_19_SDA1            0x03                                      /* I2C-1数据线（非开漏）        */

#define P0_19_FNUC            P0_19_GPIO

/*
 *  P0.20
 */
#define P0_20_GPIO            0x00                                      /* GPIO                         */
#define P0_20_DTR1            0x01                                      /* UART1终端就绪DTR             */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_20_SCL1            0x03                                      /* I2C-1时钟线（非开漏）        */

#define P0_20_FNUC            P0_20_GPIO

/*
 *  P0.21
 */
#define P0_21_GPIO            0x00                                      /* GPIO                         */
#define P0_21_RI1             0x01                                      /* UART1振铃信号                */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_21_RD1             0x03                                      /* CAN-1接收引脚                */

#define P0_21_FNUC            P0_21_GPIO

/*
 *  P0.22
 */
#define P0_22_GPIO            0x00                                      /* GPIO                         */
#define P0_22_RTS1            0x01                                      /* UART1请求发送引脚            */
//...   Reserved              0x02                                      /* 保留                         */
#define P0_22_TD1             0x03                                      /* CAN-1发送线                  */

#define P0_22_FNUC            P0_22_GPIO

/*
 *  P0.23
 */
#define P0_23_GPIO            0x00                                      /* GPIO                         */
#define P0_23_AD00            0x01                                      /* ADC-0，通道0                 */
#define P0_23_I2SRX_CLK       0x02                                      /* I2S接收时钟SCK               */
#define P0_23_CAP30           0x03                                      /* 定时器3捕获输入，通道0       */

#define P0_23_FNUC            P0_23_AD00

/*
 *  P0.24
 */
#define P0_24_GPIO            0x00                                      /* GPIO                         */
#define P0_24_AD01            0x01                                      /* ADC-0，通道1                 */
#define P0_24_I2SRX_WS        0x02                                      /* I2S接收字选择WS              */
#define P0_24_CAP31           0x03                                      /* 定时器3捕获输入，通道1       */

#define P0_24_FNUC            P0_24_AD01

/*
 *  P0.25
 */
#define P0_25_GPIO            0x00                                      /* GPIO                         */
#define P0_25_AD02            0x01                                      /* ADC-0，通道2                 */
#define P0_25_I2SRX_SDA       0x02                                      /* I2S接收数据SD                */
#define P0_25_TXD3            0x03                                      /* UART3发送引脚                */

#define P0_25_FNUC            P0_25_AD02

/*
 *  P0.26
 */
#define P0_26_GPIO            0x00                                      /* GPIO                         */
#define P0_26_AD03            0x01                                      /* ADC-0，通道3                 */
#define P0_26_AOUT            0x02                                      /* DAC输出                      */
#define P0_26_RXD3            0x03                                      /* UART-3接收引脚               */

#define P0_26_FNUC            P0_26_AD03

/*
 *  P0.27
 */
#define P0_27_GPIO            0x00                                      /* GPIO                         */
#define P0_27_SDA0            0x01                                      /* I2C0数据输入/输出，开漏      */
#define P0_27_USB_SDA         0x02                                      /* USB接口I2C串行数据OTG收发器  */
//..    Reserved              0x03                                      /* 保留                         */

#define P0_27_FNUC            P0_27_SDA0

/*
 *  P0.28
 */
#define P0_28_GPIO            0x00                                      /* GPIO                         */
#define P0_28_SCL0            0x01                                      /* I2C0时钟输入，开漏           */
#define P0_28_USB_SCL         0x02                                      /* USB接口I2C时钟线，OTG收发器  */
//..    Reserved              0x03                                   /* 保留                         */

#define P0_28_FNUC            P0_28_SCL0

/*
 *  P0.29
 */
#define P0_29_GPIO            0x00                                      /* GPIO                         */
#define P0_29_USB_DD          0x01                                      /* USB双向数据D+线              */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P0_29_FNUC            P0_29_GPIO

/*
 *  P0.30
 */
#define P0_30_GPIO            0x00                                      /* GPIO                         */
#define P0_30_USB_DS          0x01                                      /* USB双向数据D-线              */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P0_30_FNUC            P0_30_GPIO

