zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/******************************************************************************
** P1口引脚功能设置
******************************************************************************/
/*
 *  P1.0
 */
#define P1_0_GPIO             0x00                                      /* GPIO                         */
#define P1_0_ENET_TXD0        0x01                                      /* 以太网发送数据脚0            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_0_FNUC             P1_0_GPIO

/*
 *  P1.1
 */
#define P1_1_GPIO             0x00                                      /* GPIO                         */
#define P1_1_ENET_TX_EN       0x01                                      /* 以太网发送数据脚1            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_1_FNUC             P1_1_GPIO

/*
 *  P1.4
 */
#define P1_4_GPIO             0x00                                      /* GPIO                         */
#define P1_4_ENET_TX_EN       0x01                                      /* 以太网发送使能               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_4_FNUC             P1_4_GPIO

/*
 *  P1.8
 */
#define P1_8_GPIO             0x00                                      /* GPIO                         */
#define P1_8_ENET_CRS         0x01                                      /* 以太网载波侦测脚             */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_8_FNUC             P1_8_GPIO

/*
 *  P1.9
 */
#define P1_9_GPIO             0x00                                      /* GPIO                         */
#define P1_9_ENET_RXD0        0x01                                      /* 以太网接收数据脚0            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_9_FNUC             P1_9_GPIO

/*
 *  P1.10
 */
#define P1_10_GPIO            0x00                                      /* GPIO                         */
#define P1_10_ENET_RXD1       0x01                                      /* 以太网接收数据脚1            */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_10_FNUC            P1_10_GPIO

/*
 *  P1.11
 */
#define P1_14_GPIO            0x00                                      /*  GPIO                        */
#define P1_14_ENET_RX_ER      0x01                                      /* 以太网接收错误               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_14_FNUC            P1_14_GPIO

/*
 *  P1.15
 */
#define P1_15_GPIO            0x00                                      /* GPIO                         */
#define P1_15_ENET_REF_CLK    0x01                                      /* 以太网参拷时钟输入           */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_15_FNUC            P1_15_GPIO

/*
 *  P1.16
 */
#define P1_16_GPIO            0x00                                      /* GPIO                         */
#define P1_16_ENET_MDC        0x01                                      /* 以太网MIIM时钟               */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_16_FNUC            P1_16_GPIO

/*
 *  P1.17
 */
#define P1_17_GPIO            0x00                                      /* GPIO                         */
#define P1_17_ENET_MDIO       0x01                                      /* 以太网MI数据输入\输出        */
//..    Reserved              0x02                                      /* 保留                         */
//..    Reserved              0x03                                      /* 保留                         */

#define P1_17_FNUC            P1_17_GPIO

/*
 *  P1.18
 */
#define P1_18_GPIO            0x00                                      /*  GPIO                        */
#define P1_18_USB_UP_LED      0x01                                      /* USB GOODLINK指示脚           */
#define P1_18_PWM11           0x02                                      /* PWM1输出，通道1              */
#define P1_18_CAP10           0x03                                      /* Timer1捕获输入，通道0        */

#define P1_18_FNUC            P1_18_PWM11//P1_18_GPIO//

/*
 *  P1.19
 */
#define P1_19_GPIO            0x00                                      /*  GPIO                        */
#define P1_19_MCO0A           0x01                                      /* 电机控制PWM通道0，输出A      */
#define P1_19_USB_PPWR        0x02                                      /* USB端口电源使能信号          */
#define P1_19_CAP11           0x03                                      /* Timer1捕获输入，通道1        */

#define P1_19_FNUC            P1_19_GPIO

/*
 *  P1.20
 */
#define P1_20_GPIO            0x00                                      /*  GPIO                        */
#define P1_20_MCFB0           0x01                                      /* 电机控制PWM通道0，回环输入   */
#define P1_20_PWM12           0x02                                      /* PWM-2输出，通道2             */
#define P1_20_SCK0            0x03                                      /* SSP-0时钟输入                */

#define P1_20_FNUC            P1_20_SCK0

