zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P1.21
 */
#define P1_21_GPIO            0x00                                      /* GPIO                         */
#define P1_21_MCABORT         0x01                                      /* 电机控制PWM，紧急中止        */
#define P1_21_PWM13           0x02                                      /* PWM-1输出，通道3             */
#define P1_21_SSEL0           0x03                                      /* SSP-0从机选择                */

#define P1_21_FNUC            P1_21_GPIO

/*
 *  P1.22
 */
#define P1_22_GPIO            0x00                                      /* GPIO                         */
#define P1_22_MC0B            0x01                                      /* 电机控制PWM通道0，输出B      */
#define P1_22_USB_PWRD        0x02                                      /* USB端口的电源状态            */
#define P1_22_MAT10           0x03                                      /* 定时器1匹配输出，通道0       */

#define P1_22_FNUC            P1_22_GPIO

/*
 *  P1.23
 */
#define P1_23_GPIO            0x00                                      /* GPIO                         */
#define P1_23_MCFB1           0x01                                      /* 电机控制PWM通道1，反馈输入   */
#define P1_23_PWM14           0x02                                      /* PWM-1输出，通道4             */
#define P1_23_MISO0           0x03                                      /* SSP-0主机输入，从机输出      */

#define P1_23_FNUC            P1_23_MISO0

/*
 *  P1.24
 */
#define P1_24_GPIO            0x00                                      /* GPIO                         */
#define P1_24_MCFB2           0x01                                      /* 电机控制PWM通道2，反馈输入   */
#define P1_24_PWM15           0x02                                      /* PWM-1输出，通道5             */
#define P1_24_MOSI0           0x03                                      /* SSP-0主机输出，从机输入      */

#define P1_24_FNUC            P1_24_MOSI0

/*
 *  P1.25
 */
#define P1_25_GPIO            0x00                                      /* GPIO                         */
#define P1_25_MC1A            0x01                                      /* 电机控制PWM通道1，输出A      */
#define P1_25_CLKOUT          0x02                                      /* 时钟输出引脚                 */
#define P1_25_MAT11           0x03                                      /* 定时器1匹配输出，通道1       */

#define P1_25_FNUC            P1_25_GPIO

/*
 *  P1.26
 */
#define P1_26_GPIO            0x00                                      /* GPIO                         */
#define P1_26_MC1B            0x01                                      /* 电机控制PWM通道1，输出B      */
#define P1_26_PWM16           0x02                                      /* PWM-1输出，通道6             */
#define P1_26_CAP00           0x03                                      /* 定时器0捕获输入，通道0       */

#define P1_26_FNUC            P1_26_GPIO

/*
 *  P1.27
 */
#define P1_27_GPIO            0x00                                      /* GPIO                         */
#define P1_27_CLKOUT          0x01                                      /* 时钟输出引脚                 */
#define P1_27_USB_OVRCR       0x02                                      /* USB端口过载电流状态          */
#define P1_27_CAP01           0x03                                      /* 定时器0捕获输入，通道1       */

#define P1_27_FNUC            P1_27_GPIO

/*
 *  P1.28
 */
#define P1_28_GPIO            0x00                                      /* GPIO                         */
#define P1_28_MC2A            0x01                                      /* 电机控制PWM通道2，输出A      */
#define P1_28_PCAP10          0x02                                      /* PWM-1捕获输入，通道0         */
#define P1_28_MAT00           0x03                                      /* 定时器0匹配输出，通道0       */

#define P1_28_FNUC            P1_28_GPIO

/*
 *  P1.29
 */
#define P1_29_GPIO            0x00                                      /* GPIO                         */
#define P1_29_MC2B            0x01                                      /* 电机控制PWM通道2，输出B      */
#define P1_29_PCAP11          0x02                                      /* PWM-1捕获输入，通道1         */
#define P1_29_MAT01           0x03                                      /* 定时器0匹配输出，通道1       */

#define P1_29_FNUC            P1_29_GPIO

/*
 *  P1.30
 */
#define P1_30_GPIO            0x00                                      /* GPIO                         */
//...   Reserved              0x01                                      /* 保留                         */
#define P1_30_VBUS            0x02                                      /* 存在的USB总线电源            */
#define P1_30_AD04            0x03                                      /* ADC转换器0.通道4输入         */

#define P1_30_FNUC            P1_30_GPIO

/*
 *  P1.31
 */
#define P1_31_GPIO            0x00                                      /* GPIO                         */
//...   Reserved              0x01                                      /* 保留                         */
#define P1_31_SSCK1           0x02                                      /* SSP-1时钟线                  */
#define P1_31_AD05            0x03                                      /* ADC-0输入，通道5             */

#define P1_31_FNUC            P1_31_GPIO

/******************************************************************************
** P2口引脚功能设置
******************************************************************************/
/*
 *  P2.0
 */
#define P2_0_GPIO             0x00                                      /* GPIO                         */
#define P2_0_PWM11            0x01                                      /* PWM-1，通道1                 */
#define P2_0_TXD1             0x02                                      /* UART1数据发送引脚            */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_0_FNUC             P2_0_TXD1

/*
 *  P2.1
 */
#define P2_1_GPIO             0x00                                      /* GPIO                         */
#define P2_1_PWM12            0x01                                      /* PWM-1，通道2                 */
#define P2_1_RXD1             0x02                                      /* UART1数据接收引脚            */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_1_FNUC             P2_1_RXD1

