zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P2.2
 */
#define P2_2_GPIO             0x00                                      /* GPIO                         */
#define P2_2_PWM13            0x01                                      /* PWM-1，通道3                 */
#define P2_2_CTS1             0x02                                      /* UART1清零发送线              */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_2_FNUC             P2_2_CTS1

/*
 *  P2.3
 */
#define P2_3_GPIO             0x00                                      /* GPIO                         */
#define P2_3_PWM14            0x01                                      /* PWM-1，通道4                 */
#define P2_3_DCD1             0x02                                      /* UART1数据载波检测线          */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_3_FNUC             P2_3_GPIO

/*
 *  P2.4
 */
#define P2_4_GPIO             0x00                                      /* GPIO                         */
#define P2_4_PWM15            0x01                                      /* PWM-1，通道5                 */
#define P2_4_DSR1             0x02                                      /* UART1数据设置就绪线          */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_4_FNUC             P2_4_GPIO

/*
 *  P2.5
 */
#define P2_5_GPIO             0x00                                      /* GPIO                         */
#define P2_5_PWM16            0x01                                      /* PWM-1，通道6                 */
#define P2_5_DTR1             0x02                                      /* UART1数据终端就绪线          */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_5_FNUC             P2_5_GPIO

/*
 *  P2.6
 */
#define P2_6_GPIO             0x00                                      /* GPIO                         */
#define P2_6_PCAP10           0x01                                      /* PWM-1捕获输入，通道0         */
#define P2_6_RI1              0x02                                      /* UART1振铃输入                */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_6_FNUC             P2_6_GPIO

/*
 *  P2.7
 */
#define P2_7_GPIO             0x00                                      /* GPIO                         */
#define P2_7_RD2              0x01                                      /* CAN-2接收线                  */
#define P2_7_RTS1             0x02                                      /* UART1请求发送输出            */
                                                                        /* RS-485/EIA-485输出使能信号   */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_7_FNUC             P2_7_RTS1

/*
 *  P2.8
 */
#define P2_8_GPIO             0x00                                      /* GPIO                         */
#define P2_8_TD2              0x01                                      /* CAN-2发送线                  */
#define P2_8_TXD2             0x02                                      /* UART2发送引脚                */
#define P2_8_ENET_MDC         0x03                                      /* 以太网MIIM时钟               */

#define P2_8_FNUC             P2_8_GPIO

/*
 *  P2.9
 */
#define P2_9_GPIO             0x00                                      /* GPIO                         */
#define P2_9_U1CONNECT        0x01                                      /* USB1软连接控制               */
#define P2_9_RXD2             0x02                                      /* UART2接收引脚                */
#define P2_9_ENET_MDIO        0x03                                      /* 以太网MIIM数据输入和输出     */

#define P2_9_FNUC             P2_9_GPIO

/*
 *  P2.10（ISP）
 */
#define P2_10_GPIO            0x00                                      /* GPIO                         */
#define P2_10_EINT0           0x01                                      /* 外部中断0输入                */
#define P2_10_NMI             0x02                                      /* 非屏蔽中断输入               */
//...   Reserved              0x03                                      /* 保留                         */

#define P2_10_FNUC            P2_10_GPIO

/*
 *  P2.11
 */
#define P2_11_GPIO            0x00                                      /* GPIO                         */
#define P2_11_EINT1           0x01                                      /* 外部中断1输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_11_I2STX_CLK       0x03                                      /* I2S发送时钟SCK               */
#define P2_11_FNUC            P2_11_GPIO
//#define P2_11_FNUC            P2_11_EINT1

/*
 *  P2.12
 */
#define P2_12_GPIO            0x00                                      /* GPIO                         */
#define P2_12_EINT2           0x01                                      /* 外部中断2输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_12_I2STX_WS        0x03                                      /* I2S发送字选择WS              */
#define P2_12_FNUC            P2_12_GPIO
//#define P2_12_FNUC            P2_12_EINT2

/*
 *  P2.13
 */
#define P2_13_GPIO            0x00                                      /* GPIO                         */
#define P2_13_EINT3           0x01                                      /* 外部中断3输入                */
//...   Reserved              0x02                                      /* 保留                         */
#define P2_13_I2STX_SDA       0x03                                      /* I2S发送数据SD                */

#define P2_13_FNUC            P2_13_GPIO//P2_13_EINT3

/******************************************************************************
** P3口引脚功能设置
******************************************************************************/
/*
 *  P3.25
 */
#define P3_25_GPIO            0x00                                      /*  GPIO                        */
//...   Reserved              0x01                                      /*  保留                        */
#define P3_25_MAT00           0x02                                      /*  定时器0匹配输出，通道0      */
#define P3_25_PWM12           0x03                                      /*  PWM-1输出，通道2            */

#define P3_25_FNUC            P3_25_GPIO

