zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P3
 */
#define P3_25_MODE            PIN_PULL_UP       //上拉
#define P3_26_MODE            PIN_PULL_DOWN     //下拉

/*
 *  P4
 */
#define P4_28_MODE            PIN_NO_PULL
#define P4_29_MODE            PIN_NO_PULL

/******************************************************************************
** 按原理图定义PIN
******************************************************************************/
/*
 *  P0信号宏定义
 */
#define     P0_SDA_E2           (1ul << 0)
#define     P0_SCL_E2           (1ul << 1)
#define     P0_TXD_4851         (1ul << 2)
#define     P0_RXD_4851         (1ul << 3)
#define     P0_CPU_EVERGOFF     (1ul << 4)
#define     P0_CPU_IGT          (1ul << 5)
#define     P0_PECTL            (1ul << 6)
#define     P0_ESAMI_CLK        (1ul << 7)
#define     P0_ESAM_DI          (1ul << 8)  //P0_ESAM_IO
#define     P0_ESAM_DO          (1ul << 9)

#define     P0_TXD_4852         (1ul << 10)
#define     P0_RXD_4852         (1ul << 11)
//                              (1ul << 12)
//                              (1ul << 13)
//                              (1ul << 14)
#define     P0_BEEP_ON          (1ul << 15)
#define     P0_ALARM_LED        (1ul << 16)
#define     P0_ESAM_RST         (1ul << 17)
#define     P0_C_GPRSON         (1ul << 18)
#define     P0_KEYPRG           (1ul << 19)
#define     P0_KEYG             (1ul << 20)
#define     P0_KEYD             (1ul << 21)
#define     P0_KEYUP            (1ul << 22)
#define     P0_BAT_AD           (1ul << 23)
#define     P0_BAT1_AD          (1ul << 24)
#define     P0_BAT2_AD          (1ul << 25)
#define     P0_EVENTOUT         (1ul << 26)
#define     P0_SDA_LCD          (1ul << 27)//azh
#define     P0_SCL_LCD          (1ul << 28)
#define     P0_PD_CHK           (1ul << 29)
#define     P0_KEYDOWN          (1ul << 30)
//                              (1ul << 31)

/*
 *  P1信号宏定义
 */
#define     P1_RLED_GPRS        (1ul << 0)
#define     P1_GLED_GPRS        (1ul << 1)
//                              (1ul << 2)
//                              (1ul << 3)
#define     P1_BGLED            (1ul << 4)
//                              (1ul << 5)
//                              (1ul << 6)
//                              (1ul << 7)
#define     P1_BAT_ON           (1ul << 8)
//#define     P1_GNET_LED         (1ul << 9)
//#define     P1_GDATA_LED        (1ul << 10)
#define     P1_RLED_WLS         (1ul << 9)
#define     P1_GLED_WLS         (1ul << 10)
//                              (1ul << 11)
//                              (1ul << 12)
//                              (1ul << 13)
#define     P1_FUNOUT           (1ul << 14)
#define     P1_ALARM            (1ul << 15)
#define     P1_DBG_LED          (1ul << 16)
#define     P1_IR_CTL           (1ul << 17)
#define     P1_PWM_38K          (1ul << 18)
#define     P1_WDI              (1ul << 19)
#define     P1_F1_SCK           (1ul << 20)
#define     P1_F1_CS2           (1ul << 21)
#define     P1_F1_CS1           (1ul << 22)
#define     P1_F1_MISO          (1ul << 23)
#define     P1_F1_MOSI          (1ul << 24)
#define     P1_FM_WP            (1ul << 25)
#define     P1_F1_WP            (1ul << 26)
#define     P1_E2_WP            (1ul << 27)
#define     P1_CPU_YGP          (1ul << 28)
#define     P1_CPU_WGP          (1ul << 29)
#define     P1_SW4852           (1ul << 30)
#define     P1_SW4851           (1ul << 31)

/*
 *  P2信号宏定义
 */
#define     P2_TXD_WLS          (1ul << 0)
#define     P2_RXD_WLS          (1ul << 1)
#define     P2_CTS_WLS          (1ul << 2)
#define     P2_GPRS_DTR         (1ul << 3)
#define     P2_RST_WLS          (1ul << 4)
#define     P2_GPRS_RTS         (1ul << 5)
#define     P2_GPRS_CTS         (1ul << 6)
#define     P2_RTS_WLS          (1ul << 7)
#define     P2_GPRS_DCD         (1ul << 8)
#define     P2_GPRS_RI          (1ul << 9)
#define     P2_ISP_EN           (1ul << 10)
#define     P2_IRRXD            (1ul << 11)
#define     P2_CPU_SECIN        (1ul << 12)
#define     P2_DIS_CTL          (1ul << 13)

/*
 *  P3信号宏定义
 */
#define     P3_FAST_OFF         (1ul << 25)
#define     P3_CHAG_ON          (1ul << 26)

/*
 *  P4信号宏定义
 */
#define     P4_GPRS_RXD1        (1ul << 28)//CPU_TXD
#define     P4_GPRS_TXD1        (1ul << 29)//CPU_RXD


/******************************************************************************
** 各个PORT口方向初始化值定义，把设置为输入的IO写到下面的宏，空闲的IO全部置为输出
******************************************************************************/
#define     P0_INIT_DIR         (~(P0_SDA_E2 |       \
                                   P0_RXD_4851 |     \
                                   P0_ESAM_DI |      \
                                   P0_RXD_4852 |     \
                                   P0_KEYPRG |       \
                                   P0_KEYG |         \
                                   P0_KEYD |         \
                                   P0_KEYUP  |       \
                                   P0_BAT_AD |       \
                                   P0_BAT1_AD |      \
                                   P0_BAT2_AD |      \
                                   P0_EVENTOUT |     \
                                   P0_SDA_LCD |      \
                                   P0_PD_CHK |       \
                                   P0_KEYDOWN        \
                                   )                 \
                                )

#define     P1_INIT_DIR         (~(P1_F1_MISO)       \
                                )

#define     P2_INIT_DIR        (~(P2_RXD_WLS |      \
                                   P2_ISP_EN |       \
                                   P2_IRRXD |        \
                                   P2_CPU_SECIN |    \
                                   P2_CTS_WLS |      \
                                   P2_GPRS_CTS |     \
                                   P2_GPRS_DCD |     \
                                   P2_GPRS_RI        \
                                   )                 \
                                )

#define     P3_INIT_DIR         (0xffffffff)

#define     P4_INIT_DIR         (~(P4_GPRS_TXD1     \
                                   )                 \
                                )

