zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/******************************************************************************
** 各个PORT口输出初始化值定义，把设置为输出‘1’的IO写到下面的宏，空闲的IO全部置为输出‘0’
******************************************************************************/
#define     P0_INIT_DATA        (P0_SCL_E2 |         \
                                 P0_TXD_4851 |       \
                                 P0_CPU_EVERGOFF |   \
                                 P0_CPU_IGT |        \
                                 P0_ESAMI_CLK |      \
                                 P0_ESAM_DO |        \
                                 P0_TXD_4852 |       \
                                 P0_ALARM_LED |      \
                                 P0_SCL_LCD          \
                                 )

#define     P1_INIT_DATA        (P1_RLED_WLS |       \
                                 P1_GLED_WLS |       \
                                 P1_FUNOUT |         \
                                 P1_ALARM |          \
                                 P1_IR_CTL |         \
                                 P1_DBG_LED |        \
                                 P1_F1_SCK |         \
                                 P1_F1_CS2 |         \
                                 P1_F1_CS1 |         \
                                 P1_F1_MOSI |        \
                                 P1_FM_WP |          \
                                 P1_E2_WP |          \
                                 P1_SW4852 |         \
                                 P1_SW4851 |         \
                                 P1_CPU_YGP|         \
                                 P1_CPU_WGP          \
                                 )

#define     P2_INIT_DATA        (P2_TXD_WLS |        \
                                 P2_RTS_WLS |        \
                                 P2_DIS_CTL          \
                                 )

#define     P3_INIT_DATA        (P3_FAST_OFF         \
                                 )

#define     P4_INIT_DATA        (P4_GPRS_RXD1)

/******************************************************************************
** 各个PORT口操作宏定义
******************************************************************************/
/*
 *  P0操作宏
 */
#define     PVDD_ON()               FIO0DIR |= P0_PECTL;            \
                                    FIO0CLR = P0_PECTL                  //PECTL输出‘0’,外设电源开启
#define     PVDD_OFF()              FIO0DIR |= P0_PECTL;            \
                                    FIO0SET = P0_PECTL                  //PECTL输出‘1’,外设电源关闭
#define     EMERGOFF_EN()           FIO0DIR |= P0_CPU_EVERGOFF;     \
                                    FIO0CLR = P0_CPU_EVERGOFF           //CPU_EVERGOFF输出‘0’使能GPRS的EMERGOFF
#define     EMERGOFF_DIS()          FIO0DIR |= P0_CPU_EVERGOFF;     \
                                    FIO0SET = P0_CPU_EVERGOFF           //CPU_EVERGOFF输出‘1’禁能GPRS的EMERGOFF
#define     IGT_ON()                FIO0DIR |= P0_CPU_IGT;          \
                                    FIO0CLR = P0_CPU_IGT                //CPU_IGT输出‘0’Turn on MC55/56
#define     IGT_OFF()               FIO0DIR |= P0_CPU_IGT;          \
                                    FIO0SET = P0_CPU_IGT                //CPU_IGT输出‘1’Turn off MC55/56
#define     BEEP_ON_DIS()           FIO0DIR |= P0_BEEP_ON;          \
                                    FIO0CLR = P0_BEEP_ON                //BEEP_ON输出‘0’关闭蜂鸣器
#define     BEEP_ON_EN()            FIO0DIR |= P0_BEEP_ON;          \
                                    FIO0SET = P0_BEEP_ON                //BEEP_ON输出‘1’开启蜂鸣器
#define     ALARM_LED_ON()          FIO0DIR |= P0_ALARM_LED;        \
                                    FIO0CLR = P0_ALARM_LED              //ALARM_LED输出‘0’点亮报警灯
#define     ALARM_LED_OFF()         FIO0DIR |= P0_ALARM_LED;        \
                                    FIO0SET = P0_ALARM_LED              //ALARM_LED输出‘1’熄灭报警灯
#define     ESAM_RST_EN()           FIO0DIR |= P0_ESAM_RST;         \
                                    FIO0CLR = P0_ESAM_RST               //ESAM_RST输出‘0’,使能复位?
#define     ESAM_RST_DIS()          FIO0DIR |= P0_ESAM_RST;         \
                                    FIO0SET = P0_ESAM_RST               //ESAM_RST输出‘1’,禁能复位?
#define     GPRS_POWER_DIS()        FIO0DIR |= P0_C_GPRSON;         \
                                    FIO0CLR = P0_C_GPRSON               //C_GPRSON输出‘0’禁能GPRS供电
#define     GPRS_POWER_EN()         FIO0DIR |= P0_C_GPRSON;         \
                                    FIO0SET = P0_C_GPRSON               //C_GPRSON输出‘1’开启GPRS供电

#define     SET_PORT0_IN(pin)       FIO0DIR &= ~pin
#define     PORT0_IS_HIGH(pin)     (FIO0PIN & pin)
#define     SET_PORT0_OUT(pin)      FIO0DIR |= pin
#define     SET_PORT0_HIGH(pin)     FIO0SET = pin
#define     SET_PORT0_LOW(pin)      FIO0CLR = pin
#define     SET_PORT0_REV(pin)      if(PORT0_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT0_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT0_HIGH(pin);        \
                                    }

/*
 *  P1操作宏
 */
#define     BGLED_ON()              FIO1DIR |= P1_BGLED;            \
                                    FIO1SET = P1_BGLED                  //BGLED输出‘1’,点亮LCD背光灯
#define     BGLED_OFF()             FIO1DIR |= P1_BGLED;            \
                                    FIO1CLR = P1_BGLED                  //BGLED输出‘0’,熄灭LCD背光灯

#define     WLS_RLED_ON()           FIO1DIR |= P1_RLED_WLS;         \
                                    FIO1SET = P1_RLED_WLS               //RLED_WLS输出‘1’,点亮ZIGBEE红灯
#define     WLS_RLED_OFF()          FIO1DIR |= P1_RLED_WLS;         \
                                    FIO1CLR = P1_RLED_WLS               //RLED_WLS输出‘0’,熄灭ZIGBEE红灯
#define     WLS_GLED_ON()           FIO1DIR |= P1_GLED_WLS;         \
                                    FIO1SET = P1_GLED_WLS               //GLED_WLS输出‘1’,点亮ZIGBEE绿灯
#define     WLS_GLED_OFF()          FIO1DIR |= P1_GLED_WLS;         \
                                    FIO1CLR = P1_GLED_WLS               //GLED_WLS输出‘0’,熄灭ZIGBEE绿灯
#define     GPRS_RLED_ON()          FIO1DIR |= P1_RLED_GPRS;        \
                                    FIO1SET = P1_RLED_GPRS              //RLED_GPRS输出‘1’,点亮GPRS红灯
#define     GPRS_RLED_OFF()         FIO1DIR |= P1_RLED_GPRS;        \
                                    FIO1CLR = P1_RLED_GPRS              //RLED_GPRS输出‘0’,熄灭GPRS红灯
#define     GPRS_GLED_ON()          FIO1DIR |= P1_GLED_GPRS;        \
                                    FIO1SET = P1_GLED_GPRS              //GLED_GPRS输出‘1’,点亮GPRS绿灯
#define     GPRS_GLED_OFF()         FIO1DIR |= P1_GLED_GPRS;        \
                                    FIO1CLR = P1_GLED_GPRS              //GLED_GPRS输出‘0’,熄灭GPRS绿灯

#define     FUNOUT_ON()             FIO1DIR |= P1_FUNOUT;           \
                                    FIO1CLR = P1_FUNOUT                 //FUNOUT输出‘0’,功能输出开启
#define     FUNOUT_OFF()            FIO1DIR |= P1_FUNOUT;           \
                                    FIO1SET = P1_FUNOUT                 //FUNOUT输出‘1’,功能输出关闭
#define     ALARM_ON()              FIO1DIR |= P1_ALARM;            \
                                    FIO1CLR = P1_ALARM                  //ALARM输出‘0’,报警输出开启
#define     ALARM_OFF()             FIO1DIR |= P1_ALARM;            \
                                    FIO1SET = P1_ALARM                  //ALARM输出‘1’,报警输出关闭
#define     IR_VDD_ON()             FIO1DIR |= P1_IR_CTL;           \
                                    FIO1CLR = P1_IR_CTL                 //IR_CTL输出‘0’,IRDA电源开启
#define     IR_VDD_OFF()            FIO1DIR |= P1_IR_CTL;           \
                                    FIO1SET = P1_IR_CTL                 //IR_CTL输出‘1’,IRDA电源关闭

#define     DBG_LED_ON()            FIO1DIR |= P1_DBG_LED;          \
                                    FIO1CLR = P1_DBG_LED                //DEBUG_LED输出‘0’,DEBUG_LED点亮
#define     DBG_LED_OFF()           FIO1DIR |= P1_DBG_LED;          \
                                    FIO1SET = P1_DBG_LED                //DEBUG_LED输出‘1’,DEBUG_LED熄灭

