zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
#define     BAT_ON()                FIO1DIR |= P1_BAT_ON;          \
                                    FIO1SET = P1_BAT_ON                //BAT_ON输出‘0’,GPRS电池开启
#define     BAT_OFF()               FIO1DIR |= P1_BAT_ON;          \
                                    FIO1CLR = P1_BAT_ON                //BAT_ON输出‘1’,GPRS电池关闭



#define     FLS1_CS_EN()            FIO1DIR |= P1_F1_CS1;           \
                                    FIO1CLR = P1_F1_CS1                 //F1_CS1输出‘0’,FLASH1片选使能
#define     FLS1_CS_DIS()           FIO1DIR |= P1_F1_CS1;           \
                                    FIO1SET = P1_F1_CS1                 //F1_CS1输出‘1’,FLASH1片选禁能
#define     FLS2_CS_EN()            FIO1DIR |= P1_F1_CS2;           \
                                    FIO1CLR = P1_F1_CS2                 //F1_CS2输出‘0’,FLASH2片选使能
#define     FLS2_CS_DIS()           FIO1DIR |= P1_F1_CS2;           \
                                    FIO1SET = P1_F1_CS2                 //F1_CS2输出‘1’,FLASH2片选禁能
#define     DF_WP_EN()              FIO1DIR |= (P1_F1_WP);          \
                                    FIO1CLR = (P1_F1_WP)               //F1_WP输出‘0’,FLASH1写保护使能
#define     DF_WP_DIS()             FIO1DIR |= (P1_F1_WP);          \
                                    FIO1SET = (P1_F1_WP)               //F1_WP输出‘1’,FLASH1写保护禁能
#define     EE_WP_EN()              FIO1DIR |= P1_E2_WP;            \
                                    FIO1SET = P1_E2_WP                  //WP_E2输出‘1’,EEPROM写保护使能
#define     EE_WP_DIS()             FIO1DIR |= P1_E2_WP;            \
                                    FIO1CLR = P1_E2_WP                  //WP_E2输出‘0’,EEPROM写保护禁能
#define     FM_WP_EN()              FIO1DIR |= P1_FM_WP;            \
                                    FIO1SET = P1_FM_WP                  //WP_FM输出‘1’,FRAM写保护使能
#define     FM_WP_DIS()             FIO1DIR |= P1_FM_WP;            \
                                    FIO1CLR = P1_FM_WP                  //WP_FM输出‘0’,FRAM写保护禁能
#define     WGP_ON()                FIO1DIR |= P1_CPU_WGP;          \
                                    FIO1CLR = P1_CPU_WGP                //CPU_WGP输出‘0’,点亮无功灯并输出无功脉冲
#define     WGP_OFF()               FIO1DIR |= P1_CPU_WGP;          \
                                    FIO1SET = P1_CPU_WGP                //CPU_WGP输出‘1’,熄灭无功灯并关闭无功脉冲
#define     YGP_ON()                FIO1DIR |= P1_CPU_YGP;          \
                                    FIO1CLR = P1_CPU_YGP                //CPU_YGP输出‘0’,点亮有功灯并输出有功脉冲
#define     YGP_OFF()               FIO1DIR |= P1_CPU_YGP;          \
                                    FIO1SET = P1_CPU_YGP                //CPU_YGP输出‘1’,熄灭有功灯并关闭有功脉冲

#define     SET_PORT1_IN(pin)       FIO1DIR &= ~pin
#define     PORT1_IS_HIGH(pin)     (FIO1PIN & pin)
#define     SET_PORT1_OUT(pin)      FIO1DIR |= pin
#define     SET_PORT1_HIGH(pin)     FIO1SET = pin
#define     SET_PORT1_LOW(pin)      FIO1CLR = pin
#define     SET_PORT1_REV(pin)      if(PORT1_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT1_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT1_HIGH(pin);        \
                                    }

/*
 *  P2操作宏
 */
#define     WLS_RST_LOW()           FIO2DIR |= P2_RST_WLS;          \
                                    FIO2CLR = P2_RST_WLS                //RST_WLS输出‘0’,ZigBee复位使能
#define     WLS_RST_HIGH()          FIO2DIR |= P2_RST_WLS;          \
                                    FIO2SET = P2_RST_WLS                //RST_WLS输出‘1’,ZigBee复位禁能
#define     VLCD_ON()               FIO2DIR |= P2_DIS_CTL;          \
                                    FIO2SET = P2_DIS_CTL                //DIS_CTL输出‘1’,LCD电源开启
#define     VLCD_OFF()              FIO2DIR |= P2_DIS_CTL;          \
                                    FIO2CLR = P2_DIS_CTL                //DIS_CTL输出‘0’,LCD电源关闭

#define     SET_PORT2_IN(pin)       FIO2DIR &= ~pin
#define     PORT2_IS_HIGH(pin)     (FIO2PIN & pin)
#define     SET_PORT2_OUT(pin)      FIO2DIR |= pin
#define     SET_PORT2_HIGH(pin)     FIO2SET = pin
#define     SET_PORT2_LOW(pin)      FIO2CLR = pin
#define     SET_PORT2_REV(pin)      if(PORT2_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT2_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT2_HIGH(pin);        \
                                    }

/*
 *  P3操作宏
 */
#define     CHARGE_EN()             FIO3DIR |= P3_CHAG_ON;          \
                                    FIO3SET = P3_CHAG_ON                //CHAG_ON输出‘1’,GPRS充电电源开启
#define     CHARGE_DIS()            FIO3DIR |= P3_CHAG_ON;          \
                                    FIO3CLR = P3_CHAG_ON                //CHAG_ON输出‘1’,GPRS充电电源关闭
#define     FAST_CHARGE_ON()        FIO3DIR |= P3_FAST_OFF;         \
                                    FIO3CLR = P3_FAST_OFF               //FAST_OFF输出‘0’开起充电
#define     FAST_CHARGE_OFF()       FIO3DIR |= P3_FAST_OFF;         \
                                    FIO3SET = P3_FAST_OFF               //FAST_OFF输出‘1’关闭充电

#define     SET_PORT3_IN(pin)       FIO3DIR &= ~pin
#define     PORT3_IS_HIGH(pin)     (FIO3PIN & pin)
#define     SET_PORT3_OUT(pin)      FIO3DIR |= pin
#define     SET_PORT3_HIGH(pin)     FIO3SET = pin
#define     SET_PORT3_LOW(pin)      FIO3CLR = pin
#define     SET_PORT3_REV(pin)      if(PORT3_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT3_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT3_HIGH(pin);        \
                                    }


