zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
/*
 *  P4操作宏
 */
#define     SET_PORT4_IN(pin)       FIO4DIR &= ~pin
#define     PORT4_IS_HIGH(pin)     (FIO4PIN & pin)
#define     SET_PORT4_OUT(pin)      FIO4DIR |= pin
#define     SET_PORT4_HIGH(pin)     FIO4SET = pin
#define     SET_PORT4_LOW(pin)      FIO4CLR = pin
#define     SET_PORT4_REV(pin)      if(PORT4_IS_HIGH(pin))          \
                                    {                               \
                                        SET_PORT4_LOW(pin);         \
                                    }                               \
                                    else                            \
                                    {                               \
                                        SET_PORT4_HIGH(pin);        \
                                    }

#endif//                                    
/******************************************************************************
** 外设控制位在PCONP中定义
******************************************************************************/
#define PCTIM0_Enable         1                                         /* 禁止定时器/计数器0功率/时钟  */
#define PCTIM0_Disable        0                                         /* 使能定时器/计数器0功率/时钟  */
#define PCTIM0_FUNC           PCTIM0_Disable

#define PCTIM1_Enable         1                                         /* 禁止定时器/计数器1功率/时钟  */
#define PCTIM1_Disable        0                                         /* 禁止定时器/计数器1功率/时钟  */
#define PCTIM1_FUNC           PCTIM1_Disable

#define PCUART0_Enable        1                                         /* 使能UART0功率/时钟控制位     */
#define PCUART0_Disable       0                                         /* 禁止UART0功率/时钟控制位     */
#define PCUART0_FUNC          PCUART0_Disable

#define PCUART1_Enable        1                                         /* 使能UART1功率/时钟控制位     */
#define PCUART1_Disable       0                                         /* 禁止UART1功率/时钟控制位     */
#define PCUART1_FUNC          PCUART1_Disable

#define PWM1_Enable           1                                         /* 使能PWM1功率/时钟控制位      */
#define PWM1_Disable          0                                         /* 禁止PWM1功率/时钟控制位      */
#define PWM1_FUNC             PWM1_Disable

#define PCI2C0_Enable         1                                         /* 使能I2C0接口功率/时钟控制位  */
#define PCI2C0_Disable        0                                         /* 禁止I2C0接口功率/时钟控制位  */
#define PCI2C0_FUNC           PCI2C0_Disable

#define PCSPI_Enable          1                                         /* 使能SPI接口功率/时钟控制位   */
#define PCSPI_Disable         0                                         /* 禁止SPI接口功率/时钟控制位   */
#define PCSPI_FUNC            PCSPI_Disable

#define PCRTC_Enable          1                                         /* 使能RTC功率/时钟控制位       */
#define PCRTC_Disable         0                                         /* 禁止RTC功率/时钟控制位       */
#define PCRTC_FUNC            PCRTC_Disable

#define PCSSP1_Enable         1                                         /* 使能SSP1接口功率/时钟控制位  */
#define PCSSP1_Disable        0                                         /* 禁止SSP1接口功率/时钟控制位  */
#define PCSSP1_FUNC           PCSSP1_Disable

#define PCAD_Enable           1                                         /* 使能A/D转换器功率/时钟控制位 */
#define PCAD_Disable          0                                         /* 禁止A/D转换器功率/时钟控制位 */
#define PCAD_FUNC             PCAD_Disable

#define PCCAN1_Enable         1                                         /* 使能CAN控制器1功率/时钟控制位*/
#define PCCAN1_Disable        0                                         /* 禁止CAN控制器1功率/时钟控制位*/
#define PCCAN1_FUNC           PCCAN1_Disable

#define PCCAN2_Enable         1                                         /* 使能CAN控制器2功率/时钟控制位*/
#define PCCAN2_Disable        0                                         /* 禁止CAN控制器2功率/时钟控制位*/
#define PCCAN2_FUNC           PCCAN2_Disable

#define PCGPIO_Enable         1                                         /* 使能GPIO                     */
#define PCGPIO_Disable        0                                         /* 禁止GPIO                     */
#define PCGPIO_FUNC           PCGPIO_Disable

#define PCRIT_Enable          1                                         /* 使能重复中断定时器           */
#define PCRIT_Disable         0                                         /* 禁止重复中断定时器           */
#define PCRIT_FUNC            PCRIT_Disable

#define PCMC_Enable           1                                         /* 使能电机控制PWM              */
#define PCMC_Disable          0                                         /* 禁止电机控制PWM              */
#define PCMC_FUNC             PCMC_Disable

#define PCQEI_Enable          1                                         /* 使能正交编码器接口           */
#define PCQEI_Disable         0                                         /* 禁止正交编码器接口           */
#define PCQEI_FUNC            PCQEI_Disable

#define PCI2C0_Enable         1                                         /* 使能I2C0接口功率/时钟控制位  */
#define PCI2C0_Disable        0                                         /* 禁止I2C0接口功率/时钟控制位  */
#define PCI2C0_FUNC           PCI2C0_Disable

#define PCI2C1_Enable         1                                         /* 使能I2C1接口功率/时钟控制位  */
#define PCI2C1_Disable        0                                         /* 禁止I2C1接口功率/时钟控制位  */
#define PCI2C1_FUNC           PCI2C1_Disable

#define PCSSP0_Enable         1                                         /* 使能SSP0接口功率/时钟控制位  */
#define PCSSP0_Disable        0                                         /* 禁止SSP0接口功率/时钟控制位  */
#define PCSSP0_FUNC           PCSSP0_Disable

#define PCTIM2_Enable         1                                         /* 使能定时器2功率/时钟控制位   */
#define PCTIM2_Disable        0                                         /* 禁止定时器2功率/时钟控制位   */
#define PCTIM2_FUNC           PCTIM2_Disable

#define PCTIM3_Enable         1                                         /* 使能定时器3功率/时钟控制位   */
#define PCTIM3_Disable        0                                         /* 禁止定时器3功率/时钟控制位   */
#define PCTIM3_FUNC           PCTIM3_Disable

