zhengalbert/gprs_mdl/src/startup/lpc1700_pin_cfg.h
#define PCUART2_Enable        1                                         /* 使能UART2功率/时钟控制位     */
#define PCUART2_Disable       0                                         /* 禁止UART2功率/时钟控制位     */
#define PCUART2_FUNC          PCUART2_Disable

#define PCUART3_Enable        1                                         /* 使能UART3功率/时钟控制位     */
#define PCUART3_Disable       0                                         /* 禁止UART3功率/时钟控制位     */
#define PCUART3_FUNC          PCUART3_Disable

#define PCI2C2_Enable         1                                         /* 使能I2C接口2功率/时钟控制位  */
#define PCI2C2_Disable        0                                         /* 禁止I2C接口2功率/时钟控制位  */
#define PCI2C2_FUNC           PCI2C2_Disable

#define PCI2S_Enable          1                                         /* 使能I2S接口功率/时钟控制位   */
#define PCI2S_Disable         0                                         /* 禁止I2S接口功率/时钟控制位   */
#define PCI2S_FUNC            PCI2S_Disable

#define PCGPDMA_Enable        1                                         /* 使能GP DMA功能功率/时钟控制位*/
#define PCGPDMA_Disable       0                                         /* 禁止GP DMA功能功率/时钟控制位*/
#define PCGPDMA_FUNC          PCGPDMA_Disable

#define PCENET_Enable         1                                         /* 使能以太网模块功率/时钟控制位*/
#define PCENET_Disable        0                                         /* 禁止以太网模块功率/时钟控制位*/
#define PCENET_FUNC           PCENET_Disable

#define PCUSB_Enable          1                                         /* 使能USB接口功率/时钟控制位   */
#define PCUSB_Disable         0                                         /* 禁止USB接口功率/时钟控制位   */
#define PCUSB_FUNC            PCUSB_Disable

/*-------------------------- functions declaration --------------------------*/
__EXTERN    void    pin_init(void);
__EXTERN    void    pconp_init(void);

#endif//__LPC1700_PIN_CFG_H

/******************************************************************************
    End Of File
******************************************************************************/
